{"id":1336,"text":"Предприятие по реализации товаров по заказам. Предприятие располагает складом, на котором хранятся товары. Для получения товара клиент оформляет заказ. Для пополнения товаров на складе предприятие заключает договоры с поставщиками.\nБизнес-правила:\n1. Организация формирует заказы из товаров, имеющихся на складе.\n2. Клиент может оформить заказ на несколько товаров.\n3. Формированием заказа занимается один сотрудник.\nМинимальный набор сущностей: товар, клиент, поставщик, сотрудник.\nМинимальный набор атрибутов: наименование товара, назначение товара, стоимость товара; фамилия клиента, контактные данные клиента, адрес клиента; название фирмы поставщика, фамилия руководителя фирмы, контактные данные, адрес фирмы; фамилия сотрудника, должность сотрудника, оклад сотрудника, номер служебного телефона сотрудника.","label":[[512,531,"string"],[533,550,"string"],[552,568,"double"],[570,585,"string"],[587,612,"string"],[614,627,"string"],[629,654,"string"],[656,682,"string"],[684,701,"string"],[703,714,"string"],[716,734,"string"],[736,756,"string"],[758,774,"double"],[776,812,"integer"]],"Comments":[]}
{"id":1337,"text":"Ремонтная мастерская занимается ремонтом бытовой техники. Клиент оформляет заказ на ремонт изделия. Ремонт изделий осуществляется с использованием комплектующих, которые имеются на складе мастерской. Для пополнения комплектующих на складе мастерская заключает договоры с поставщиками.\nБизнес-правила:\n1. Существуют клиенты, нескольких категорий приоритетности.\n2. Каждый клиент может оформить неограниченное количество заказов.\n3. Клиенты оформляют один заказ на ремонт одного изделия.\n4. Для получения заменяемой детали сотрудник организации оформляет отдельный заказ на получение детали со склада.\n5. Один заказ выполняется одним сотрудником.\nМинимальный набор сущностей: изделие, клиент, сотрудник, деталь.\nМинимальный набор атрибутов: наименование изделия, вид изделия, стоимость изделия; фамилия клиента, контактные данные клиента, адрес клиента; фамилия сотрудника, должность сотрудника, оклад сотрудника, номер служебного телефона сотрудника; название детали, её стоимость, количество на складе, название фирмы производителя. ","label":[[739,759,"string"],[761,772,"string"],[774,791,"double"],[793,808,"string"],[810,835,"string"],[837,850,"string"],[852,870,"string"],[872,892,"string"],[894,910,"double"],[912,948,"integer"],[950,965,"string"],[970,979,"double"],[981,1001,"integer"],[1003,1031,"string"]],"Comments":[]}
{"id":1338,"text":"Фирма по прокату автомобилей. Фирма оказывает услуги, предоставляя автомобили из своего парка. Фирма выдаёт напрокат автомобили на основе договора. Сотрудник фирмы фиксирует данные о клиенте, данные об автомобиле, дату начала проката и количество дней проката.\nБизнес-правила:\n1. Клиент оформляет договор на прокат автомобиля.\n2. Клиент может оформить несколько договоров.\n3. Фирма ежегодно страхует автомобили в различных страховых компаниях.\n4. Стоимость проката зависит от марки автомобиля.\nМинимальный набор сущностей: автомобиль, клиент, страховая компания, сотрудник.\nМинимальный набор атрибутов: номер автомобиля, его цвет, марка, год выпуска, сумма страховки; фамилия клиента, номер его паспорта и водительского удостоверения, контактные данные (телефон, адрес), водительский стаж; название страховой компании, номер лицензии, адрес, фамилия руководителя; фамилия сотрудника, его должность, оклад, служебный телефон.","label":[[603,619,"string"],[625,629,"string"],[631,636,"string"],[638,649,"integer"],[651,666,"double"],[668,683,"string"],[695,703,"integer"],[706,733,"integer"],[735,752,"string"],[754,761,"integer"],[763,768,"string"],[771,788,"integer"],[790,817,"string"],[819,833,"integer"],[835,840,"string"],[842,862,"string"],[864,882,"string"],[888,897,"string"],[899,904,"double"],[906,923,"integer"]],"Comments":[]}
{"id":1339,"text":"Бизнес-правила:\n1. В гостинице имеются номера различной категории.\n2. Каждый номер закреплен за одним сотрудником. Один сотрудник может обслуживать несколько номеров.\n3. Гость может забронировать номер указанной категории на заданный срок.\n4. Стоимость номер и зависит от его категории и перечня дополнительных услуг, которыми пользовался гость.\nМинимальный набор сущностей: номер, сотрудник, гость, услуга.\nМинимальный набор атрибутов: номер комнаты, её тип, статус (занята, забронирована, свободна), состояние (готова к проживанию, требует уборки, требует ремонта); фамилия гостя, его категория, номер паспорта, дата заселения, срок пребывания, гражданство; фамилия сотрудника, специальность, оклад, контактный телефон.","label":[[437,450,"integer"],[455,458,"string"],[460,466,"string"],[502,511,"string"],[568,581,"string"],[587,596,"string"],[598,612,"integer"],[614,628,"timestamp"],[630,645,"integer"],[647,658,"string"],[660,678,"string"],[680,693,"string"],[695,700,"double"],[702,720,"integer"]],"Comments":[]}
{"id":1340,"text":"Бизнес-правила:\n1. Клиент оформляет договор на ремонт автомобиля.\n2. Один автомобиль ремонтирует одна бригада сотрудников.\n3. Для ремонта автомобиля используются комплектующие различного типа и производителей.\n4. Стоимость часа работы зависит от и категории бригады.\n5. Различают несколько категорий клиентов.\nМинимальный набор сущностей: автомобиль, клиент, бригада, деталь.\nМинимальный набор атрибутов: номер автомобиля, его цвет, марка, год выпуска; фамилия клиента, номер его паспорта и водительского удостоверения, контактные данные (телефон, адрес); номер бригады, категория, тип (определяет, какие марки машин могут ремонтировать), фамилия бригадира, служебный телефон, стоимость часа работы; название детали, её стоимость, производитель, наличие на складе.","label":[[405,421,"string"],[427,431,"string"],[433,438,"string"],[440,451,"integer"],[453,468,"string"],[480,488,"integer"],[491,518,"integer"],[520,537,"string"],[539,546,"integer"],[548,553,"string"],[556,569,"integer"],[571,580,"string"],[582,585,"string"],[639,656,"string"],[658,675,"integer"],[677,698,"double"],[700,715,"string"],[720,729,"double"],[731,744,"string"],[746,763,"boolean"]],"Comments":[]}
{"id":1341,"text":"Бизнес-правила:\n1. Агентство занимается оформлением недвижимости в аренду.\n2. Клиент может арендовать несколько объектов.\n3. Для оформления одного объекта оформляется один договор.\n4. С каждым объектом недвижимости работает один сотрудник.\nМинимальный набор сущностей: клиент, сотрудник, объект недвижимости, договор.\nМинимальный набор атрибутов: фамилия клиента, его категория, контактные данные клиента, адрес клиента, номер паспорта; фамилия сотрудника, должность сотрудника, оклад сотрудника, номер служебного телефона сотрудника; вид объекта (дом, квартира, комната и т.п.), его стоимость, адрес, состояние (новое, после ремонта, требует ремонта и т.п.), статус (занят, свободен); дата заключения договора, срок договора.","label":[[347,362,"string"],[368,377,"string"],[379,404,"string"],[406,419,"string"],[421,435,"integer"],[437,455,"string"],[457,477,"string"],[479,495,"double"],[497,533,"integer"],[535,546,"string"],[584,593,"double"],[595,600,"string"],[602,612,"string"],[660,667,"string"],[686,710,"timestamp"],[712,725,"integer"]],"Comments":[]}
{"id":1342,"text":"Бизнес-правила:\n1. Пациент заключает договор на лечение в заданном отделении больницы.\n2. У каждого пациента есть лечащий врач.\n3. Пациент может оплачивать свой договор за счёт страховой компании.\n4. Обследование пациента проводит не только лечащий врач.\nМинимальный набор сущностей: пациент, врач, обследование, страховая компания.\nМинимальный набор атрибутов: фамилия пациента, его категория, номер паспорта, номер страхового полиса, дата поступления, гражданство; фамилия врача, категория, специальность, оклад, контактный телефон; название обследования, вид обследования, дата проведения обследования, стоимость обследования; название страховой компании, номер лицензии, фамилия руководителя, контактный телефон.","label":[[362,378,"string"],[384,393,"string"],[395,409,"integer"],[411,434,"integer"],[436,452,"timestamp"],[454,465,"string"],[467,480,"string"],[482,491,"string"],[493,506,"string"],[508,513,"double"],[515,533,"integer"],[535,556,"string"],[558,574,"string"],[576,604,"timestamp"],[606,628,"double"],[630,657,"string"],[659,673,"integer"],[675,695,"string"],[697,715,"integer"]],"Comments":[]}
{"id":1343,"text":"Бизнес-правила:\n1. Для выполнения работ типография заключает договор с клиентом.\n2. Один договор выполняет одна бригада сотрудников.\n3. Стоимость работ зависит от вида продукции, вида материалов и тиража издания.\n4. Различают несколько категорий клиентов.\n5. Для выполнения работ используются материалы.\nМинимальный набор сущностей: клиент, издание, бригада сотрудников, материал.\nМинимальный набор атрибутов: фамилия клиента, контактные данные клиента, адрес клиента; наименование издания, его вид, стоимость издания; номер бригады, специализация, номер служебного телефона бригадира; название материала, её стоимость, количество на складе, название фирмы производителя. ","label":[[410,425,"string"],[427,452,"string"],[454,467,"string"],[469,489,"string"],[495,498,"string"],[500,517,"double"],[519,532,"integer"],[534,547,"string"],[549,584,"integer"],[586,604,"string"],[609,618,"double"],[620,640,"integer"],[642,670,"string"]],"Comments":[]}
{"id":1344,"text":"Бизнес-правила:\n1. Договор страхования заключается между страховой компанией и клиентом сроком не более 1 года (но может быть и меньше).\n2. При заключении договора указывается вид страхования, страховая сумма, дата начала действия договора.\n3. Один клиент может заключить несколько договоров.\n4. Один сотрудник работает с несколькими клиентами.\n5. Страхование осуществляется на основе существующего вида услуг.\nМинимальный набор сущностей: клиент, сотрудник, страховой продукт, договор.\nМинимальный набор атрибутов: фамилия клиента, его категория, контактные данные клиента, адрес клиента, номер паспорта; фамилия сотрудника, должность сотрудника, оклад сотрудника, номер служебного телефона сотрудника; название страхового продукта (дом, квартира, комната, автомобиль и т.п.), его базовая стоимость; дата заключения договора, дата завершения, объект страхования, его оценочная стоимость.","label":[[516,531,"string"],[537,546,"string"],[548,573,"string"],[575,588,"string"],[590,604,"integer"],[606,624,"string"],[626,646,"string"],[648,664,"double"],[666,702,"integer"],[704,732,"string"],[782,799,"double"],[801,825,"timestamp"],[827,842,"timestamp"],[844,862,"string"],[868,887,"double"]],"Comments":[]}
{"id":1345,"text":"Необходимо создать базу данных для приложения, учитывающего информацию о домашней коллекции CD и DVD. Хранится информация о контенте диска (музыка, фильмы). Для музыкального произведения хранится информация об исполнителе, альбоме, название песни, жанр и год выхода альбома. Для фильма – название, режиссер, список актеров и жанр фильма. Необходимо учитывать, что песня или фильм могут встречаться более чем на одном диске.","label":[[210,221,"string"],[223,230,"string"],[232,246,"string"],[248,252,"string"],[255,273,"integer"],[288,296,"string"],[298,306,"string"],[308,322,"string"],[325,336,"string"]],"Comments":[]}
{"id":1346,"text":"Необходимо создать базу данных для приложения, обслуживающего информационные потребности цветочного магазина. В БД должны храниться сведения о цветах, которые есть в продаже (название, класс, цена, кол-во экземпляров, срок завоза, страна происхождения). Кроме этого, необходимо создать иерархический классификатор цветов (Класс-Отряд-Семейство-Вид) для облегчения поиска необходимых растений. Каждый класс имеет название и краткое описание. БД также должна учитывать продажи цветов (дата продажи, кол-во проданных экземпляров).","label":[[175,183,"string"],[185,190,"string"],[192,196,"double"],[198,216,"integer"],[218,229,"integer"],[231,251,"string"],[412,421,"string"],[423,439,"string"],[483,495,"timestamp"],[497,525,"integer"]],"Comments":[]}
{"id":1347,"text":"Для пункта проката видеопродукции необходимо создать приложение и БД для учета выдачи видео. Видео может храниться на DVD, CD или видеокассетах, причем один и тот же фильм может встречаться на разных носителях. Для каждого фильма необходимо хранить информацию о названии, жанре, режиссере и список актеров. Для каждой единицы проката необходимо хранить цену проката за сутки и сумму залога. При выдаче прокатной продукции необходимо сохранять дату выдачи и ФИО клиента. При возврате – дату возврата.","label":[[262,270,"string"],[272,277,"string"],[279,289,"string"],[291,305,"string"],[353,374,"double"],[377,389,"double"],[443,454,"timestamp"],[457,468,"string"],[485,498,"timestamp"]],"Comments":[]}
{"id":1348,"text":"При факультете ПММ организовали платные курсы для обучения школьников информатике. Для каждого курса хранится информация о продолжительности (в часах), стоимости, программа курса (список тем), а также фамилия преподавателя. Школьники могут записаться на один или несколько курсов. При регистрации школьника записывается его ФИО и школа и класс, в которой он обучается. Оплата может производиться сразу, а может – позже. При окончании курса выдается свидетельство, номер которого записывается в БД.","label":[[123,141,"integer"],[152,161,"double"],[163,178,"string"],[201,222,"string"],[324,328,"string"],[330,336,"string"],[338,343,"string"],[464,470,"integer"]],"Comments":[]}
{"id":1349,"text":"Для хранения данных на сайте необходимо создать базу данных. Требования к данным:\n1. Необходимо хранить информацию о пользователях: псевдоним, реальные фамилию,имя, отчество, номер ICQ, телефон, e-mail. У пользователя может быть несколько e-mail, но только один из них является основным, который будет использоваться для связи. Кроме этого, у пользователя может быть один или несколько аватаров – графических файлов. Для аватара необходимо хранить имя файла и размер.\n2. Каждый пользователь может создать несколько сообщений, которые тоже нужно хранить в базе данных. Для каждого сообщения хранится тема, дата создания и текст сообщения. К сообщению могут быть приложены дополнительные файлы, для них нужно хранить полное размещение, тип (документ, графика, видео), размер и описание.\n3. На каждое сообщение другие пользователи могут оставлять свои сообщения. Допускаются анонимные пользователи.\n4. У каждого пользователя могут быть друзья из числа других пользователей.","label":[[132,141,"string"],[152,159,"string"],[160,163,"string"],[165,173,"string"],[175,184,"integer"],[186,193,"integer"],[195,201,"string"],[239,245,"string"],[448,457,"string"],[460,466,"integer"],[599,603,"string"],[605,618,"timestamp"],[621,636,"string"],[715,732,"string"],[734,738,"string"],[766,773,"integer"],[775,783,"string"]],"Comments":[]}
{"id":1350,"text":"В ГИБДД решили автоматизировать деятельность одного из своих подразделений и создать приложение для учета автомобилей. В базе данных необходимо хранить информацию об автомобилях и их владельцах. Человек может владеть несколькими автомобилями. Необходимо хранить следующую информацию:\n1. О владельце: ФИО, номер паспорта, номер водительского удостоверения, адрес\n2. Об автомобиле: модель, номер кузова, номер двигателя, номер тех. паспорта, дату регистрации.\n3. Необходимо хранить историю смены владельцев\n4. Так же необходимо хранить информацию об угнанных и найденных автомобилях, для этого необходимо предусмотреть хранение информации о дате угона, месте угона, дате и месте нахождения.","label":[[300,303,"string"],[305,319,"integer"],[321,354,"integer"],[356,361,"string"],[380,386,"string"],[388,400,"integer"],[402,417,"integer"],[419,438,"integer"],[440,456,"timestamp"],[639,649,"timestamp"],[651,662,"string"],[664,687,"string"]],"Comments":[]}
{"id":1351,"text":"База данных хроники восхождений в альпинистском клубе. В базе данных должны записываться даты начала и завершения каждого восхождения, имена и адреса участвовавших в нем альпинистов, название и высота горы, страна и район, где эта гора расположена.","label":[[89,100,"timestamp"],[103,114,"timestamp"],[135,141,"string"],[143,150,"string"],[183,192,"string"],[194,201,"integer"],[207,214,"string"],[216,221,"string"]],"Comments":[]}
{"id":1352,"text":"База данных медицинского кооператива. Базу данных использует для работы коллектив врачей. В таблицы должны быть занесены имя, пол, дата рождения и домашний адрес каждого их пациента. Всякий раз, когда врач осматривает больного, явившегося к нему на прием, или сам приходит к нему на дом, он записывает дату и место, где проводится осмотр, симптомы, диагноз и предписания больному, проставляет имя пациента, а также свое имя. Если врач прописывает больному какое-либо лекарство, в таблицу заносится название лекарства, способ его приема, словесное описание предполагаемого действия и возможных побочных эффектов.","label":[[121,124,"string"],[126,129,"string"],[131,144,"timestamp"],[147,161,"string"],[302,307,"timestamp"],[309,314,"string"],[339,347,"string"],[349,357,"string"],[359,379,"string"],[393,405,"string"],[420,423,"string"],[498,516,"string"],[518,535,"string"],[537,610,"string"]],"Comments":[]}
{"id":1353,"text":"База данных Городской Думы. В базе хранятся имена, адреса, домашние и служебные телефоны всех членов Думы. В Думе работает порядка сорока комиссий, все участники которых являются членами Думы. Каждая комиссия имеет свой профиль, например, вопросы образования, проблемы, связанные с жильем и так далее. Данные по каждой из комиссий включают: ее нынешний состав и председатель, прежние председатели и члены этой комиссии, участвовавшие в ее работе за прошедшие 10 лет, даты включения и выхода из состава комиссии, избрания ее председателей. Члены Думы могут заседать в нескольких комиссиях. В базу заносятся время и место проведения каждого заседания комиссии с указанием депутатов и служащих Думы, которые участвуют в его организации.","label":[[44,49,"string"],[51,57,"string"],[80,89,"integer"],[344,359,"string"],[362,374,"string"],[384,397,"string"],[399,405,"string"],[467,472,"timestamp"],[606,612,"timestamp"],[614,620,"string"],[670,695,"string"]],"Comments":[]}
{"id":1354,"text":"Фирме принадлежит небольшая флотилия рыболовных катеров. Каждый катер имеет \"паспорт\", куда занесены его название, тип, водоизмещение и дата постройки. Фирма регистрирует каждый выход на лов, записывая название катера, имена и адреса членов команды с указанием их должностей (капитан, боцман и т.д.), даты выхода и возвращения, а также вес пойманной рыбы отдельно по сортам (например, трески). За время одного рейса катер может посетить несколько банок. Фиксируется дата прихода на каждую банку и дата отплытия, качество выловленной рыбы (отличное, хорошее,\nплохое). На борту улов не взвешивается. ","label":[[105,113,"string"],[115,118,"string"],[120,134,"integer"],[136,150,"timestamp"],[202,217,"string"],[219,225,"string"],[227,234,"string"],[264,275,"string"],[301,306,"timestamp"],[336,354,"double"],[466,481,"timestamp"],[497,510,"timestamp"],[512,537,"string"]],"Comments":[]}
{"id":1355,"text":"База данных фирмы, проводящей аукционы. Фирма занимается продажей с аукциона антикварных изделий и произведений искусства. Владельцы вещей, выставляемых на проводимых фирмой аукционах, юридически являются продавцами. Лица, приобретающие эти вещи, именуются покупателями. Получив от продавцов партию предметов, фирма решает, на котором из аукционов выгоднее представить конкретный предмет. Перед проведением очередного аукциона каждой из выставляемых на нем вещей присваивается отдельный номер лота, играющий ту же роль, что и введенный ранее шифр товара. Две вещи, продаваемые на различных аукционах, могут иметь одинаковые номера лотов.\nВ книгах фирмы делается запись о каждом аукционе. Там отмечаются дата, место и время его проведения, а также специфика (например, выставляются картины, написанные маслом и не ранее 1900 г.). Заносятся также сведения о каждом продаваемом предмете: аукцион, на который он заявлен, номер лота, продавец, отправная цена и краткое словесное описание. Продавцу разрешается выставлять любое количество вещей, а покупатель имеет право приобретать любое количество вещей. Одно и то же лицо или фирма может выступать и как продавец, и как покупатель.\nПосле аукциона служащие фирмы, проводящей аукционы, записывают фактическую цену, уплаченную за проданный предмет, и фиксируют данные покупателя. ","label":[[487,497,"integer"],[542,553,"string"],[624,636,"integer"],[703,707,"timestamp"],[709,715,"string"],[717,723,"timestamp"],[747,757,"string"],[885,892,"string"],[917,927,"integer"],[929,937,"string"],[939,953,"double"],[956,982,"string"],[1242,1258,"double"],[1274,1291,"string"],[1305,1322,"string"]],"Comments":[]}
{"id":1356,"text":"Разработать информационную систему обслуживания библиотеки, которая содержит следующую информацию: названия книг, ФИО авторов, наименования издательств, год издания, количество страниц, количество иллюстраций, стоимость, название филиала библиотеки или книгохранилища, в которых находится книга, количество имеющихся в библиотеке экземпляров конкретной книги, количество студентов, которым выдавалась конкретная книга, названия факультетов, в\nучебном процессе которых используется указанная книга.","label":[[99,112,"string"],[114,125,"string"],[127,151,"string"],[153,164,"integer"],[166,184,"integer"],[186,208,"integer"],[210,219,"double"],[221,237,"string"],[296,316,"integer"],[360,400,"integer"],[419,480,"string"]],"Comments":[]}
{"id":1357,"text":"База данных по учету успеваемости студентов. База данных должна содержать данные о контингенте студентов (фамилия, имя, отчество, год поступления, форма обучения (дневная\/вечерняя\/заочная), номер или название группы); об учебном плане (название специальности, дисциплина, семестр, количество отводимых на дисциплину часов, форма отчетности (экзамен\/зачет)); о журнале успеваемости студентов (год\/семестр, студент, дисциплина, оценка).","label":[[106,113,"string"],[115,118,"string"],[120,128,"string"],[130,145,"integer"],[147,161,"string"],[190,215,"string"],[236,258,"string"],[260,270,"string"],[272,279,"integer"],[281,321,"integer"],[323,339,"string"],[392,395,"integer"],[396,403,"integer"],[405,412,"string"],[414,424,"string"],[426,432,"integer"]],"Comments":[]}
{"id":1358,"text":"База данных для учета аудиторного фонда университета. База данных должна содержать следующую информацию об аудиторном фонде университета. Наименование корпуса, в котором расположено помещение, номер комнаты, расположение комнаты в корпусе, ширина и длина комнаты в метрах, назначение и вид помещения, подразделение университета, за которым закреплено помещение. В базе данных также должна быть информация о высоте потолков в помещениях в зависимости от места расположения помещений в корпусе. Следует также учитывать, что структура подразделений университета имеет иерархический вид, когда одни подразделения входят в состав других (факультет, кафедра, лаборатория). ","label":[[138,158,"string"],[193,206,"integer"],[208,238,"string"],[240,247,"integer"],[249,255,"integer"],[273,284,"string"],[286,290,"string"],[301,327,"string"],[407,422,"integer"]],"Comments":[]}
{"id":1359,"text":"База данных для регистрации происшествий. Необходимо создать Базу данных для регистрации происшествий. База данных должна содержать данные для регистрации сообщений о происшествиях (регистрационный номер сообщения, дата регистрации, краткая фабула (тип происшествия); информацию о принятом по происшествию решении (отказано в возбуждении дел, удовлетворено ходатайство о возбуждении уголовного дела с указанием регистрационный номера заведенного дела, отправлено по территориальному признаку); информацию о лицах, виновных или подозреваемых в совершении происшествия (регистрационный номер лица, фамилия, имя, отчество, адрес, количество судимостей), отношение конкретных лиц к конкретным происшествиям (виновник, потерпевший, подозреваемый, свидетель)","label":[[182,213,"integer"],[215,231,"timestamp"],[233,247,"string"],[315,341,"boolean"],[343,398,"boolean"],[411,450,"integer"],[452,491,"boolean"],[568,594,"integer"],[596,603,"string"],[605,608,"string"],[610,618,"string"],[620,625,"string"],[627,648,"integer"],[704,712,"string"],[714,725,"string"],[727,740,"string"],[742,751,"string"]],"Comments":[]}
{"id":1360,"text":"База данных для обслуживания работы конференции. База данных должна содержать справочник персоналий участников конференции (фамилия, имя, отчество, ученая степень, ученое звание, научное направление, место работы, кафедра (отдел), должность, страна, город, почтовый индекс, адрес, рабочий телефон, домашний телефон, e-mail), и информацию, связанную с участием в конференции (докладчик или участник, дата рассылки 1-го приглашения, дата поступления заявки, тема доклада, отметка о поступлении тезисов, дата рассылки 2-го приглашения, дата поступления оргвзноса, размер поступившего оргвзноса, дата приезда, дата отъезда, потребность в гостинице). ","label":[[124,131,"string"],[133,136,"string"],[138,146,"string"],[148,162,"string"],[164,177,"string"],[179,198,"string"],[200,212,"string"],[214,222,"string"],[231,240,"string"],[242,248,"string"],[250,255,"string"],[257,272,"integer"],[274,279,"string"],[281,296,"integer"],[298,314,"integer"],[316,322,"string"],[375,397,"boolean"],[399,429,"timestamp"],[431,454,"timestamp"],[456,468,"string"],[470,499,"boolean"],[501,531,"timestamp"],[533,559,"timestamp"],[561,590,"double"],[592,604,"timestamp"],[606,618,"timestamp"],[620,643,"boolean"]],"Comments":[]}
{"id":1361,"text":"База данных должна обеспечить автоматизацию складского учета. В ней должны содержаться следующие данные:\n• информация о \"единицах хранения\" - номер ордера, дата, код поставщика, балансный счет, код сопроводительного документа по справочнику документов, номер сопроводительного документа, код материала по справочнику материалов, счет материала, код единицы измерения, количество пришедшего материала, цена единицы измерения);\n• информация о хранящихся на складе материалах (справочник материалов - код класса материала, код группы материала, наименование материала);\n• информация о единицах измерения конкретных видов материалов - код материала, единица измерения (метры, килограммы, литры и т.д.);\n• информация о поставщиках материалов - код поставщика, его наименование, ИНН, юридический адрес (индекс, город, улица, дом), адрес банка (индекс, город, улица, дом), номер банковского счета. ","label":[[142,154,"integer"],[156,160,"timestamp"],[162,176,"integer"],[178,192,"string"],[194,225,"integer"],[253,286,"integer"],[288,301,"integer"],[329,343,"string"],[345,366,"integer"],[368,399,"integer"],[401,423,"double"],[498,518,"integer"],[520,540,"integer"],[542,564,"string"],[631,644,"integer"],[646,663,"string"],[739,753,"integer"],[759,771,"string"],[773,776,"integer"],[778,795,"string"],[825,836,"string"],[866,889,"integer"]],"Comments":[]}
{"id":1362,"text":"Завод \"Прогресс\" поставляет товары (изделие А, изделие В, изделие С и др.) заказчикам по договорам. Для каждого товара определены планы поставок. Необходимо спроектировать базу данных ПОСТАВКА ТОВАРОВ, информация которой будет использоваться для анализа выполнения заводом планов поставок.\nВ БД должна храниться информация:\n• о ТОВАРАХ: код товара, наименование товара, цена товара (тыс. руб.);\n• ЗАКАЗАХ на поставку товаров: код заказа, наименование заказчика, адрес заказчика, телефон, номер договора, дата заключения договора, наименование товара, плановая поставка (шт.);\n• фактических ОТГРУЗКАХ товаров: код отгрузки, код заказа, дата отгрузки, отгружено товара (шт.).\nПри проектировании БД необходимо учитывать следующее:\n• товар имеет несколько заказов на поставку. Заказ соответствует одному товару;\n• товару могут соответствовать несколько отгрузок. В отгрузке могут участвовать несколько товаров.\nКроме того следует учесть:\n• товар не обязательно имеет заказ. Каждому заказу обязательно соответствует товар;\n• товар не обязательно отгружается заказчику. Каждая отгрузка обязательно соответствует некоторому товару.","label":[[337,347,"integer"],[349,368,"string"],[370,381,"double"],[426,436,"integer"],[438,460,"string"],[462,477,"string"],[479,486,"integer"],[488,502,"integer"],[504,528,"timestamp"],[530,549,"string"],[551,568,"integer"],[609,621,"integer"],[623,633,"integer"],[635,648,"timestamp"],[650,666,"integer"]],"Comments":[]}
{"id":1363,"text":"Магазин розничной торговли продает персональные компьютеры, средства связи и периферийное оборудование: принтеры, накопители CD-RW и др. Необходимо спроектировать базу данных РОЗНИЧНАЯ ТОРГОВЛЯ, информация которой будет использоваться для анализа продаж в магазине.\nВ БД должна храниться информация:\n• о ТОВАРАХ: код товара, наименование товара, дата поступления в магазин, количество товара, цена закупки (руб.);\n• ПОСТАВЩИКАХ товаров: код поставщика, наименование поставщика, адрес, телефон, к кому обращаться;\n• ПРОДАЖАХ товаров в магазине: код продажи, код товара, дата продажи, количество проданного товара (шт.), цена розничная (руб.).\nПри проектировании БД необходимо учитывать следующее:\n• поставщик поставляет несколько товаров. Товар поступает на склад магазина от нескольких поставщиков;\n• товар имеет несколько продаж. Продажа относится к одному товару.\nКроме того следует учесть:\n• поставщик не обязательно поставляет товар (может временно не работать). Каждый товар обязательно поставляется;\n• товар не обязательно продается. Каждая продажа обязательно связана с товаром.","label":[[313,323,"integer"],[325,344,"string"],[346,372,"timestamp"],[374,391,"integer"],[393,405,"double"],[437,451,"integer"],[453,476,"string"],[478,483,"string"],[485,492,"integer"],[543,555,"integer"],[557,567,"integer"],[569,581,"timestamp"],[583,611,"integer"],[619,633,"double"]],"Comments":[]}
{"id":1364,"text":"Клиентам банка предлагается размещать денежные средства на срочные банковские вклады различных видов (табл. 2.1).\nСрочные банковские вклады\nНаименование вклада\t                                                 Срок хранения, мес.\tСтавка, % годовых\nНакопительный (в российских рублях)\t      13\t                                           10 %\nКапитал (в долларах США)\t \t                    18                                                7 %\nПобеда (в белорусских рублях)\t \t      13                                               Ставка рефинансирования + 2 %\nК отпуску (в белорусских рублях)\t \t      12                                               Ставка рефинансирования – 1 %\nНакопительный (в белорусских рублях)\t      36\t                                            18 %\nНеобходимо спроектировать базу данных БАНКОВСКИЕ ВКЛАДЫ, информация которой будет использоваться для анализа работы с клиентами по вкладам.\nВ БД должна храниться информация:\n• о ВКЛАДАХ, которые предоставляет банк: код вклада; наименование вклада; срок хранения (месяцев); ставка, % годовых;\n• КЛИЕНТАХ, которые помещают денежные средства на вклады: код клиента, Ф.И.О. клиента, номер паспорта, адрес, телефон;\n• СЧЕТАХ клиентов банка: № счета, код клиента, код вклада, дата открытия счета, дата закрытия счета, сумма вложенная (руб.).\nПри проектировании БД необходимо учитывать следующее:\n• клиент банка может помещать свои средства на несколько счетов. Счет открывается на одного клиента;\n• каждый вид вклада связан с несколькими счетами клиентов. Счет относится к одному виду вклада.\nКроме того следует учесть:\n• каждый клиент обязательно имеет счет в банке. Каждый счет обязательно принадлежит клиенту;\n• вклад некоторого вида не обязательно может быть связан со счетами клиентов. Каждый счет клиента обязательно связан с некоторым видом вклада.","label":[[988,998,"integer"],[1000,1019,"string"],[1021,1034,"integer"],[1046,1052,"integer"],[1123,1134,"integer"],[1136,1150,"string"],[1152,1166,"integer"],[1168,1173,"string"],[1175,1182,"integer"],[1209,1216,"integer"],[1218,1229,"integer"],[1231,1241,"integer"],[1243,1262,"timestamp"],[1264,1283,"timestamp"],[1285,1300,"double"]],"Comments":[]}
{"id":1365,"text":"Сотрудники разных категорий (1-й, 2-й, 3-й) аудиторской фирмы осуществляют проверку предприятий в течение года. Работа сотрудников оплачивается за каждый час в зависимости от категории сотрудника. Необходимо спроектировать базу данных АУДИТ, информация которой будет использоваться для автоматизации начисления зарплаты сотрудникам.\nВ БД должна храниться информация:\n• о СОТРУДНИКАХ аудиторской фирмы: код сотрудника, Ф.И.О. сотрудника, номер паспорта, дата рождения, рабочий телефон;\n• КАТЕГОРИЯХ сотрудников: категория, ставка за 1 час (тыс. руб.);\n• выполненной сотрудниками РАБОТЕ на предприятиях: название предприятия, код сотрудника, дата выполнения работы, количество отработанных часов.\nПри проектировании БД необходимо учитывать следующее:\n• определенную категорию могут иметь несколько сотрудников. Сотрудник имеет квалификацию только одной категории;\n• сотрудник может выполнять несколько работ по проверке на разных предприятиях. Работу по проверке предприятия могут проводить несколько сотрудников.\nКроме того следует учесть:\n• каждый сотрудник обязательно имеет категорию. Определенная категория не обязательно может быть у сотрудников аудиторской фирмы;\n• сотрудник не обязательно выполняет работу по проверке на предприятии. Каждая работа по проверке на предприятии обязательно выполняется сотрудниками.","label":[[402,416,"integer"],[418,435,"string"],[437,451,"integer"],[453,466,"timestamp"],[468,483,"integer"],[511,520,"string"],[522,537,"double"],[602,622,"string"],[624,638,"integer"],[640,662,"timestamp"],[664,693,"integer"]],"Comments":[]}
{"id":1366,"text":"На склад готовой продукции фабрики по пошиву одежды в течение года поступают производимые ею товары разных моделей. Необходимо спроектировать базу данных ФАБРИКА, информация которой будет использоваться для учета готовой продукции, хранящейся на складе.\nВ БД должна храниться информация:\n• о видах ТОВАРА (пальто женское, костюм женский и др.): код товара, наименование товара;\n• МОДЕЛЯХ одежды, выпускаемой фабрикой: код модели, наименование модели, код товара, цена модели (тыс. руб.);\n• ПОСТУПЛЕНИЯХ на склад: код поступления, код модели, дата поступления модели товара, количество (шт.), кто принял товар.\nПри проектировании БД необходимо учитывать следующее:\n• товар имеет несколько моделей. Модель связана с одним товаром;\n• модель связана с несколькими поступлениями. Поступление связано с одной моделью товара.\nКроме того следует учесть:\n• каждый вид товар обязательно имеет модели. Каждая модель обязательно связана с определенным товаром;\n• модель обязательно связана с поступлениями на склад. Поступление обязательно связано с моделью товара.","label":[[345,355,"integer"],[357,376,"string"],[418,428,"integer"],[430,449,"string"],[451,461,"integer"],[463,474,"double"],[513,528,"integer"],[530,540,"integer"],[542,572,"timestamp"],[574,585,"integer"],[592,608,"string"]],"Comments":[]}
{"id":1367,"text":"Работники турагенства продают путевки путешествий по разным странам. В каждую страну организуются несколько маршрутов. По каждому маршруту указывается цель путешествия (отдых, экскурсия, лечение, шоп-тур, обучение и др.). Необходимо спроектировать базу данных ТУРАГЕНСТВО, информация которой позволит определять наиболее популярные маршруты за текущий год, отслеживать обращения клиентов и др.\nВ БД должна храниться информация:\n• о СТРАНАХ: код страны, название страны, стоимость визы (руб.);\n• МАРШРУТАХ: код страны, код маршрута, наименование маршрута;\n• ПРОДАЖАХ: код маршрута, цель путешествия, цена путевки (руб.), количество проданных путевок по маршруту, дата продажи.\nПри проектировании БД необходимо учитывать следующее:\n• в каждую страну организуются несколько маршрутов. Маршрут имеет отношение только к одной стране;\n• маршрут участвует в нескольких продажах. Продажа связана только с одним маршрутом.\nКроме того следует учесть:\n• по каждой стране обязательно организуется маршрут. Каждый маршрут обязательно имеет отношение к некоторой стране;\n• маршрут не обязательно может участвовать в продаже (может быть невостребован). Каждая продажа обязательно связана с одним маршрутом.","label":[[441,451,"integer"],[453,468,"string"],[470,484,"double"],[506,516,"integer"],[518,530,"integer"],[532,553,"string"],[567,579,"integer"],[581,597,"string"],[599,611,"double"],[620,660,"integer"],[662,674,"timestamp"]],"Comments":[]}
{"id":1368,"text":"Отделы крупного торгового дома ежедневно продают различные виды товаров и ведут учет сведений о проданных товарах. Необходимо спроектировать базу данных ТОРГОВЛЯ, информация которой будет использоваться для анализа выполнения плана реализации продукции в отделах; определения товаров, пользующихся наибольшим спросом и др.\nВ БД должна храниться информация:\n• об ОТДЕЛАХ: код отдела, наименование отдела, Ф.И.О. заведующего отделом, телефон, объем реализации в день (руб.);\n• ТОВАРАХ: артикул товара, наименование товара, единица измерения, розничная цена товара (руб.);\n• ПРОДАЖАХ: артикул товара, дата продажи, количество проданного товара.\nПри проектировании БД необходимо учитывать следующее:\n• отдел ежедневно осуществляет несколько продаж. Каждая продажа имеет отношение только к одному отделу;\n• товар участвует в нескольких продажах. Каждая продажа соотносится только с одним товаром.\nКроме того следует учесть:\n• каждый отдел обязательно осуществляет продажу. Каждая продажа обязательно осуществляется отделом;\n• товар не обязательно может участвовать в продаже (может быть невостребован). В продаже обязательно участвует товар.","label":[[371,381,"integer"],[383,402,"string"],[404,430,"string"],[432,439,"integer"],[441,464,"double"],[484,498,"integer"],[500,519,"string"],[521,538,"string"],[540,561,"double"],[582,596,"integer"],[598,610,"timestamp"],[612,640,"integer"]],"Comments":[]}
{"id":1369,"text":"Отделение Белпочты каждое полугодие осуществляет подписку граждан (в дальнейшем получателей) на различные издания (газеты, журналы) на один, три или шесть месяцев. Необходимо спроектировать базу данных ПОДПИСНЫЕ ИЗДАНИЯ, информация которой будет использоваться для учета получателей и выписанных ими изданий.\nВ БД должна храниться информация:\n• об ИЗДАНИЯХ, на которые можно оформить подписку: индекс издания, вид издания (газета, журнал), название издания, стоимость подписки на издание на 1 месяц (руб.);\n• получателях: код получателя, Ф.И.О. получателя, адрес получателя (улица, дом, квартира);\n• подписках, осуществленных получателями: код получателя, индекс издания, срок подписки (в месяцах), месяц начала доставки издания, год начала доставки издания.\nПри проектировании БД необходимо учитывать следующее:\n• получатель может осуществить подписку несколько раз (подписаться на несколько изданий). Каждая подписка осуществляется одним получателем;\n• издание может быть использовано для нескольких подписок (на издание могут подписаться несколько получателей). Каждая подписка соответствует одному изданию.\nКроме того следует учесть:\n• каждый получатель обязательно осуществляет хотя бы одну подписку. Каждая подписка обязательно соответствует получателю;\n• на издание не обязательно может быть подписка (оно может быть не востребовано). Подписка обязательно соответствует некоторому изданию.","label":[[394,408,"integer"],[410,421,"string"],[440,456,"string"],[458,498,"double"],[522,536,"integer"],[538,555,"string"],[557,573,"string"],[640,654,"integer"],[656,670,"integer"],[672,685,"integer"],[699,728,"integer"],[730,757,"integer"]],"Comments":[]}
{"id":1370,"text":"Библиотека располагает фондом книг, который постоянно пополняется. Книги, находящиеся в библиотеке, изданы различными издательствами. Каждый читатель может взять на абонемент не более пяти книг на срок до 20 дней. Необходимо спроектировать базу данных БИБЛИОТЕКА, информация которой будет использоваться для получения оперативной информации о наличии книг в библиотеке, наличии книг у читателя, для контроля своевременности возврата книг и др.\nВ БД должна храниться информация:\n• об ИЗДАТЕЛЬСТВАХ: код издательства, наименование издательства, город;\n• КНИГАХ: шифр книги, название книги, первый автор, год издания, цена книги (руб.), количество экземпляров (шт.);\n• ЧИТАТЕЛЯХ: код читателя, Ф.И.О. читателя, адрес, телефон;\n• ВЫДАЧАХ: код читателя, шифр книги, дата выдачи, роспись.\nПри проектировании БД необходимо учитывать следующее:\n• в фонде библиотеки могут храниться несколько книг одного и того же издательства. Книга издается только одним издательством;\n• книга может быть затребована несколько раз на выдачу. Каждая выдача относится к одной книге;\n• читатель может быть задействован в выдаче нескольких книг. Каждая выдача относится к одному читателю.\nКроме того следует учесть:\n• каждая книга, находящаяся в фонде библиотеки, обязательно издается издательством. Издательство обязательно издает книги;\n• книга не обязательно может быть затребована на выдачу. Каждая выдача обязательно связана с книгой;\n• каждый читатель обязательно задействован в выдаче. В каждой выдаче обязательно задействован читатель.","label":[[498,514,"integer"],[516,541,"string"],[543,548,"string"],[560,570,"string"],[572,586,"string"],[588,600,"string"],[602,613,"integer"],[615,625,"double"],[634,656,"integer"],[677,689,"integer"],[691,706,"string"],[708,713,"string"],[715,722,"integer"],[735,747,"integer"],[749,759,"string"],[761,772,"timestamp"],[774,781,"string"]],"Comments":[]}
{"id":1371,"text":"Хозрасчетная поликлиника оказывает различные медицинские услуги. Прием пациентов осуществляется врачами строго по талонам. Для врача каждой специальности определен набор талонов, используемый ежедневно. На каждого пациента заводится медицинская карта. Оплата услуги осуществляется после приема и постановки диагноза. Стоимость визита к врачу зависит от категории врача (1-я, 2-я, 3-я) и цели посещения: консультация, обследование, лечение и др. Некоторым пациентам предоставляется скидка на обслуживание. Необходимо спроектировать базу данных ПОЛИКЛИНИКА, информация которой позволит хранить сведения о заболеваниях пациентов, частоте их обращения, загрузке врачей, выручке от оказания медицинских услуг и др.\nВ БД должна храниться информация:\n• о ВРАЧАХ: Ф.И.О. врача, специальность, категория;\n• ПАЦИЕНТАХ: номер медкарты, Ф.И.О. пациента, дата рождения, адрес, пол, скидка на обслуживание (%);\n• ежедневном ПРИЕМЕ пациентов: номер талона на прием к врачу, дата визита, цель посещения, стоимость визита (руб.);\n• ДИАГНОЗАХ: код диагноза, наименование диагноза.\nПри проектировании БД необходимо учитывать следующее:\n• врач осуществляет по талонам ежедневно несколько приемов. Каждый прием осуществляется одним врачом;\n• пациент может приходить на прием к одному врачу несколько раз. На прием по талону приходит только один пациент;\n• один и тот же диагноз выставляется на приеме нескольким пациентам. На одном приеме выставляется один диагноз.\nКроме того следует учесть:\n• каждый врач обязательно принимает пациентов, которые взяли талон. Каждый прием обязательно осуществляется врачом;\n• каждый пациент обязательно приходит на прием по талону. На каждый прием обязательно приходит пациент;\n• возможный диагноз не обязательно выставляется на приеме (его может не быть у принятых врачом пациентов). На приеме обязательно выставляется диагноз.","label":[[756,768,"string"],[770,783,"string"],[785,794,"string"],[809,823,"integer"],[825,840,"string"],[842,855,"timestamp"],[857,862,"string"],[864,867,"string"],[869,891,"double"],[928,957,"integer"],[959,970,"timestamp"],[972,986,"string"],[988,1004,"double"],[1026,1038,"integer"],[1040,1061,"string"]],"Comments":[]}
{"id":1372,"text":"Работники цехов предприятия получают со скидкой спецодежду (халаты, тапочки, комбинезоны и др.) для выполнения производственных функций. Процент скидки зависит от занимаемой должности и может составлять от 30 до 50 % стоимости единицы вида спецодежды. Спецодежда имеет разный срок носки, по истечении которого она подлежит замене. Ежедневно кладовщик цеха ведет учет выдачи спецодежды. Необходимо спроектировать базу данных СПЕЦОДЕЖДА, информация которой будет использоваться для получения оперативных сведений о наличии спецодежды у работников; формирования списка работников, нуждающихся в замене спецодежды; планирования закупок спецодежды и др.\nВ БД должна храниться информация:\n• о СПЕЦОДЕЖДЕ: код спецодежды, вид спецодежды, срок носки, стоимость единицы (руб.);\n• ЦЕХАХ, работники которых пользуются различными видами спецодежды: код цеха, наименование цеха, Ф.И.О. начальника цеха;\n• РАБОТНИКАХ: код работника, Ф.И.О. работника, должность, скидка на спецодежду (%);\n• ПОЛУЧЕНИИ: код работника, код спецодежды, дата получения, роспись.\nПри проектировании БД необходимо учитывать следующее:\n• в цеху работают несколько работников. Работник работает только в одном цеху;\n• работник цеха участвует в получении нескольких видов спецодежды. Каждое получение имеет отношение только к одному работнику;\n• один и тот же вид спецодежды поступает несколько раз для получения. Каждое получение относится к одному виду спецодежды.\nКроме того следует учесть:\n• каждый работник обязательно работает в цеху. В каждом цехе обязательно работают работники;\n• работники некоторых должностей не обязательно участвуют в получении спецодежды. В каждом получении обязательно участвует работник;\n• каждый вид спецодежды обязательно поступает для получения. Каждое получение обязательно относится к некоторому виду спецодежду.","label":[[699,713,"integer"],[715,729,"string"],[731,741,"integer"],[743,760,"double"],[837,845,"integer"],[847,864,"string"],[866,888,"string"],[904,917,"integer"],[919,935,"string"],[937,946,"string"],[948,968,"double"],[987,1000,"integer"],[1002,1016,"integer"],[1018,1032,"timestamp"],[1034,1041,"string"]],"Comments":[]}
{"id":1373,"text":"ГАИ города производит регистрацию автомобилей. Инспектора дорожно-патрульной службы следят за безопасностью дорожного движения. В случае нарушения правил дорожного движения к водителям применяются меры взысканий. Виды нарушений и меры взысканий определяются Кодексом об административных правонарушениях. Необходимо спроектировать базу данных ГАИ, информация которой будет использоваться для подведения статистики совершаемых водителями нарушений правил дорожного движения; выявления водителей, многократно совершающих нарушения правил дорожного движения; определения наиболее аварийных районов города, размера штрафа за совершенное нарушение и др.\nВ БД должна храниться информация:\n• о водителях: номер водительского удостоверения, Ф.И.О., адрес, телефон;\n• АВТОМОБИЛЯХ: номер автомобиля, марка, модель, цвет, год выпуска, дата регистрации в ГАИ;\n• нарушениях правил дорожного движения: код нарушения, вид нарушения (превышение скорости, управление автомобилем в состоянии алкогольного опьянения и др.), штраф за нарушение (диапазон долей базовой величины. Например, штраф за превышение скорости составляет 0,5-10 базовых величин), предупреждение сделать или не сделать (Да\/Нет, \"Да\" означает, что инспектор должен сделать водителю предупреждение за совершенное нарушение), срок лишения права управления автомобилем (диапазон месяцев. Например, срок за управление автомобилем в состоянии алкогольного опьянения составляет 12 – 36 месяцев);\n• взысканиях с водителей-нарушителей: код нарушения, дата и время нарушения, номер водительского удостоверения, район совершения нарушения, размер штрафа (доля базовой величины, определяемая инспектором по кодексу об административных правонарушениях), оплачен штраф или не оплачен (Да\/Нет), срок лишения права управления автомобилем (количество месяцев, определяемое инспектором по Кодексу об административных правонарушениях), базовая величина (на дату совершения нарушения, тыс. руб.), личный номер инспектора ДПС, установившего нарушение.\nПри проектировании БД необходимо учитывать следующее:\n• водитель может иметь несколько автомобилей. Автомобиль принадлежит одному водителю;\n• водитель может получить несколько взысканий (он может совершить несколько нарушений). Взыскание применяется к одному водителю;\n• одному и тому же нарушению могут соответствовать несколько взысканий (взыскания к водителям могут применяться за один и тот же вид нарушения). Взысканию соответствует единственное нарушение.\nКроме того следует учесть:\n• каждый водитель обязательно имеет автомобиль (ГАИ хранит сведения только о тех водителях, которые зарегистрировали автомобиль). Каждый автомобиль обязательно принадлежит водителю (ГАИ хранит сведения только о зарегистрированных автомобилях);\n• водитель не обязательно получает взыскания (водитель может не совершить ни одного нарушения). Каждое взыскание обязательно применяется к водителю;\n• нарушению не обязательно соответствует взыскание (нарушение может ни разу никем не совершаться). Каждому взысканию обязательно соответствует нарушение.","label":[[697,730,"integer"],[732,738,"string"],[740,745,"string"],[747,754,"integer"],[771,787,"string"],[789,794,"string"],[796,802,"string"],[804,808,"string"],[810,821,"integer"],[823,845,"timestamp"],[887,900,"integer"],[902,915,"string"],[1004,1022,"double"],[1132,1169,"boolean"],[1274,1315,"integer"],[1478,1491,"integer"],[1493,1515,"timestamp"],[1517,1550,"integer"],[1552,1578,"string"],[1580,1593,"double"],[1692,1720,"boolean"],[1731,1772,"integer"],[1868,1884,"double"],[1928,1955,"integer"]],"Comments":[]}
{"id":1374,"text":"ЖЭС города производит начисления за коммунальные услуги. Тарифы, установленные на них, не меняются. Квартиросъемщики должны оплачивать коммунальные услуги до 15 числа каждого месяца. За несвоевременную оплату взимается пеня за каждый день просрочки в размере 0,1 % общей суммы, подлежащей оплате за месяц. Необходимо спроектировать базу данных ЖЭС, информация которой будет использоваться для выявления неплательщиков за коммунальные услуги, определения ежемесячной суммы оплаты квартиросъемщиками за коммунальные услуги, пени за несвоевременную оплату и др.\nВ БД должна храниться информация:\n• о КВАРТИРОСЪЕМЩИКАХ: лицевой счет, Ф.И.О., телефон;\n• КВАРТИРАХ: адрес (улица, дом, квартира), количество проживающих, площадь (м2);\n• услугах: код услуги, вид услуги (отопление, горячее водоснабжение, каналы ТВ и др.), единица измерения (гКал, м3, шт. и др.), тариф (руб.);\n• оплате за услугу: лицевой счет, код услуги, фактически расходовано, оплатить по дату (15.ММ.ГГ), оплачена своевременно или не своевременно (Да\/Нет), дата оплаты (указывается в случае, если оплата произведена не своевременно).\nПри проектировании БД необходимо учитывать следующее:\n• квартиросъемщик снимает одну квартиру. Квартира имеет одного квартиросъемщика;\n• квартиросъемщик производит оплату за несколько услуг. Оплата за услугу производится одним квартиросъемщиком;\n• одна и та же услуга может быть связана с несколькими оплатами (она оплачивается квартиросъемщиками в разные месяцы). Оплата относится к одной услуге.\nКроме того следует учесть:\n• каждый квартиросъемщик обязательно снимает квартиру. Каждая квартира обязательно имеет квартиросъемщика;\n• каждый квартиросъемщик обязательно производит оплату за услугу. Оплата за каждую услугу обязательно производится квартиросъемщиком;\n• услуга не обязательно подлежит оплате (услуга может быть ни разу никому не оказана). Оплата за каждую услугу обязательна.","label":[[616,628,"integer"],[630,636,"string"],[638,645,"integer"],[660,666,"string"],[690,712,"integer"],[714,722,"integer"],[739,749,"integer"],[751,761,"string"],[815,832,"string"],[856,862,"double"],[890,902,"integer"],[904,914,"integer"],[916,938,"double"],[940,957,"timestamp"],[969,1010,"boolean"],[1021,1032,"timestamp"]],"Comments":[]}
{"id":1375,"text":"Предприятие общественного питания \"Бистро\" ежедневно занимается приготовлением различных блюд по заказам клиентов. Технология приготовления каждого блюда указана в рецепте на рис. 2.1.\nЗакуска \"Лобио по-грузински\" Состав: фасоль стручковая 200 г, лук зеленый 40 г, масло сливочное 30 г, зелень 10 г. Технология приготовления: ломаную очищенную фасоль, нашинкованный лук посолить, посыпать перцем и припустить в масле с небольшим количеством воды; добавить зелень и довести до готовности. Затем запечь в духовке. Выход – 210 г. Калорий – 725.\nРис. 2.1. Пример кулинарного рецепта\nЕжедневно собираются сведения о приготовленных блюдах. Необходимо спроектировать базу данных ОБЩЕПИТ, информация которой будет использоваться для приготовления блюд и анализа их калорийности, составления меню, определения расходов предприятия и др.\nВ БД должна храниться информация:\n• о блюдах, для описания которых нужны данные, входящие в их кулинарные рецепты: номер блюда, название блюда, вид блюда (закуска, суп, горячее и т.п.), выход (вес порции, г), изображение блюда;\n• ежедневном приготовлении блюд: номер блюда, количество порций, дата приготовления;\n• рецептах: номер блюда, время приготовления блюда (мин), технология приготовления;\n• продуктах, из которых приготавливаются блюда: код продукта, название продукта, калорийность (ккал в 100 г продукта), вес продукта (г), цена (руб. за 1 кг).\nПри проектировании БД необходимо учитывать следующее:\n• блюдо может состоять из нескольких продуктов. Продукт может входить в состав нескольких блюд;\n• у блюда может быть несколько приготовлений (оно может приготавливаться в разные дни в некотором количестве порций). Приготовление соотносится с одним блюдом;\n• блюдо имеет один рецепт. Рецепт соответствует одному блюду.\nКроме того следует учесть:\n• каждое блюдо обязательно состоит из одного или нескольких продуктов. Каждый продукт обязательно входит в состав одного или нескольких блюд;\n• блюдо не обязательно приготавливается (оно может быть не востребовано клиентами). Каждое приготовление обязательно соотносится с некоторым блюдом;\n• каждое блюдо обязательно имеет рецепт. Каждый рецепт обязательно соответствует некоторому блюду.","label":[[943,954,"integer"],[956,970,"string"],[972,981,"string"],[1014,1020,"integer"],[1037,1054,"string"],[1089,1100,"integer"],[1102,1119,"integer"],[1121,1139,"timestamp"],[1153,1164,"integer"],[1166,1191,"integer"],[1199,1223,"string"],[1273,1285,"integer"],[1287,1304,"string"],[1306,1319,"integer"],[1344,1356,"integer"],[1362,1367,"double"]],"Comments":[]}
{"id":1376,"text":"Интернет-магазины реализуют потребителям бытовую технику (утюги, электрочайники, кухонные комбайны и др.) разных моделей известных фирм-производителей (Philips, Bosh, Mulinex и др.). Заказы осуществляются клиентами в интернет-магазинах в любое время суток. После подтверждения заказа клиентом по телефону курьер доставляет ему товар по указанному адресу. Необходимо спроектировать базу данных Интернет-продажи, информация которой будет использоваться для анализа спроса потребителей на конкретные модели товаров разных производителей, динамики реализации товаров в интернет-магазинах за определенные интервалы времени, сравнения условий доставки товаров в разных магазинах и др.\nВ БД должна храниться информация:\n• об Интернет-магазинах: код магазина, электронный адрес, оплата доставки (Да\/Нет);\n• Товарах: код товара, название товара, фирма, модель, технические характеристики, цена (руб.), гарантийный срок, изображение;\n• Заказах: код заказа, код магазина, код товара, дата заказа, время заказа, количество, Ф.И.О. клиента, контактный телефон, подтверждение заказа (Да\/Нет);\n• Доставке: код заказа, дата доставки, время доставки, адрес доставки, Ф.И.О. клиента, Ф.И.О. курьера.\nПри проектировании БД необходимо учитывать следующее:\n• товар может продаваться в нескольких интернет-магазинах. Интернет-магазин может предлагать к продаже несколько товаров;\n• товар может быть связан с несколькими заказами. Заказ связан с одним товаром;\n• в интернет-магазине могут осуществляться несколько заказов. Заказ связан с одним интернет-магазином;\n• заказ подлежит одной доставке. Доставка связана с одним заказом.\nКроме того следует учесть:\n• каждый товар обязательно реализуется через интернет-магазины. Каждый интернет-магазин обязательно реализует товары;\n• товар не обязательно может быть заказан. Каждый заказ обязательно связан с товаром;\n• магазин не обязательно может иметь заказы. Каждый заказ обязательно связан с определенным интернет-магазином;\n• заказ не обязательно может быть доставлен. Каждая доставка товара обязательно связана с заказом.","label":[[738,750,"integer"],[752,769,"string"],[771,786,"boolean"],[808,818,"integer"],[820,835,"string"],[837,842,"string"],[844,850,"string"],[852,878,"string"],[880,885,"double"],[893,909,"integer"],[911,922,"string"],[935,945,"integer"],[947,959,"integer"],[961,971,"integer"],[973,984,"timestamp"],[986,998,"timestamp"],[1000,1010,"integer"],[1012,1026,"string"],[1028,1046,"integer"],[1048,1068,"boolean"],[1091,1101,"integer"],[1103,1116,"timestamp"],[1118,1132,"timestamp"],[1134,1148,"string"],[1150,1164,"string"],[1166,1180,"string"]],"Comments":[]}
{"id":1377,"text":"Банки предоставляют возможность своим клиентам осуществлять безналичные расчеты с помощью эмитируемых ими пластиковых карт и обналичивать деньги в банкоматах. Каждый банк обслуживает свои банкоматы и своих клиентов по вопросам эксплуатации эмитируемых им пластиковых карт. Если карточка клиента эмитирована банком, обслуживающим банкомат, то операция выдачи наличных денег банкоматом клиенту осуществляется бесплатно. Если же клиент некоторого банка обналичивает деньги в банкомате другого банка, то банкомат снимает комиссию (1,2 % суммы выдачи). Клиенты осуществляют операции обналичивания денег в любое время суток и в любом банкомате.\nНеобходимо спроектировать базу данных Банкоматы, информация которой будет использоваться для анализа операций обналичивания денег клиентами в банкоматах разных банков, частоты обслуживания банкоматами клиентов с взыманием комиссионных вознаграждений, динамики операций обналичивания денег клиентами отдельных банков в разных банкоматах за определенные интервалы времени и др.\nВ БД должна храниться информация:\n• о Банках: код банка, название банка, юридический адрес;\n• Банкоматах: номер банкомата, адрес банкомата, код банка (обслуживающего банкомат);\n• Клиентах: номер карточки клиента, Ф.И.О. клиента, адрес клиента, код банка (обслуживающего клиента);\n• Операциях выдачи наличных денег клиентам: номер карточки клиента, номер банкомата, дата, время, комиссия (Да\/Нет), сумма выдачи (руб.)\nПри проектировании БД необходимо учитывать следующее:\n• банк обслуживает несколько банкоматов. Банкомат обслуживается одним банком;\n• банк обслуживает несколько клиентов. Клиент обслуживается одним банком;\n• банкомат обслуживает несколько клиентов. Клиент обслуживается несколькими банкоматами;\n• банкомат осуществляет несколько операций обналичивания денег. Операция обналичивания денег связана с одним банкоматом;\n• клиент осуществляет несколько операций обналичивания денег. Операция обналичивания денег связана с одним клиентом.\nКроме того следует учесть:\n• каждый банк обязательно имеет в обслуживании банкоматы. Каждый банкомат обязательно обслуживается банком;\n• каждый банк обязательно имеет клиентов. Каждый клиент обязательно обслуживается банком;\n• каждый банкомат обязательно обслуживает клиентов. Каждый клиент обязательно обслуживается банкоматами;\n• банкомат не обязательно осуществляет постоянно операции выдачи наличных денег. Каждая операция выдачи наличных денег обязательно связана с банкоматом;\n• клиент не обязательно осуществляет операции обналичивания денег. Каждая операция обналичивания денег обязательно связана с клиентом.","label":[[1061,1070,"integer"],[1072,1086,"string"],[1088,1105,"string"],[1121,1136,"integer"],[1138,1153,"string"],[1155,1164,"integer"],[1204,1226,"integer"],[1228,1242,"string"],[1244,1257,"string"],[1259,1268,"integer"],[1339,1361,"integer"],[1363,1378,"integer"],[1380,1384,"timestamp"],[1386,1391,"timestamp"],[1393,1401,"boolean"],[1412,1424,"double"]],"Comments":[]}
{"id":1378,"text":"Сервисный центр осуществляет ремонт и гарантийное обслуживание бытовой техники фирм-производителей Philips, Brown, Bosh. Клиенты осуществляют заказы на ремонт товаров по гарантии и без нее. Сотрудники центра специализируются на ремонте и обслуживании отдельных товаров и выполняют соответствующие заказы. В день исполнения заказа сервисный центр сообщает об этом клиенту. Срок бесплатного хранения отремонтированного изделия в сервисном центре составляет один месяц. После его истечения клиент лишается права бесплатного гарантийного ремонта изделия и оплачивает затраты центра на хранение данного товара (5 % стоимости ремонта за каждый дополнительный день).\nНеобходимо спроектировать базу данных РЕМОНТ БЫТОВОЙ ТЕХНИКИ, информация которой будет использоваться для учета услуг по ремонту и гарантийному обслуживанию товаров, анализа сроков исполнения заказов, видов неисправностей и др.\nВ БД должна храниться информация:\n• о товарах: код товара, наименование товара, фирма, модель, технические характеристики, гарантийный срок, изображение;\n• сотрудниках: код сотрудника, Ф.И.О. сотрудника, должность;\n• заказах: код заказа, Ф.И.О. клиента, код товара, гарантия (Да\/Нет), дата поступления заказа, телефон клиента;\n• исполнениях заказов: код заказа, вид ремонта, стоимость ремонта, дата исполнения заказа, сообщение клиенту (Да\/Нет), дата получения товара, сумма оплаты услуг (руб.).\nПри проектировании БД необходимо учитывать следующее:\n• товар может быть отремонтирован несколькими сотрудниками. Сотрудник может выполнять ремонт нескольких товаров;\n• товар может быть связан с несколькими заказами. Заказ связан с одним товаром;\n• заказ соотносится с одним исполнением. Исполнение связано с одним заказом;\n• сотрудник осуществляет несколько исполнений заказов. Исполнение заказа связано с одним сотрудником.\nКроме того следует учесть:\n• каждый товар обязательно может быть отремонтирован сотрудниками. Каждый сотрудник обязательно выполняет ремонт товаров;\n• товар не обязательно может быть связан с заказами. Каждый заказ обязательно связан с товаром;\n• заказ не обязательно подлежит исполнению. Исполнение обязательно связано с заказом;\n• сотрудник не обязательно осуществляет исполнения заказов. Каждое исполнение заказа обязательно связано с сотрудником.","label":[[935,945,"integer"],[947,966,"string"],[968,973,"string"],[975,981,"string"],[983,1009,"string"],[1011,1027,"integer"],[1029,1040,"string"],[1057,1071,"integer"],[1073,1090,"string"],[1092,1101,"string"],[1114,1124,"integer"],[1126,1140,"string"],[1142,1152,"integer"],[1154,1163,"boolean"],[1173,1196,"timestamp"],[1198,1213,"integer"],[1238,1248,"integer"],[1250,1261,"string"],[1263,1280,"double"],[1282,1304,"timestamp"],[1306,1323,"boolean"],[1334,1355,"timestamp"],[1357,1375,"double"]],"Comments":[]}
{"id":1379,"text":"Фирма специализируется на продаже офисной мебели разных видов заказчикам – школам, техникумам, вузам, фирмам, предприятиям, организациям. Это компьютерные столы различных моделей (СК-1, СК-2 и др.), тумбы (Т-1, Т-2 и др.), шкафы (Ш-1, Ш-2 и др.). Необходимо спроектировать базу данных МЕБЕЛЬ, информация которой будет использоваться для учета продаж мебели.\nВ БД должна храниться информация:\n• о моделях мебели: название мебели, модель, характеристики модели, стоимость модели;\n• покупателях: код покупателя, название покупателя, адрес покупателя, телефон покупателя;\n• договорах на продажу мебели: номер договора, код покупателя, дата оформления договора, дата исполнения договора;\n• продажах: номер договора, название мебели, модель, количество (шт.).\nПри проектировании БД необходимо учитывать следующее:\n• покупатель может заключить несколько договоров. Договор заключается одним заказчиком;\n• модель может быть связана с несколькими продажами (по разным договорам). Продажа имеет отношение к одной модели;\n• по договору могут быть проданы несколько моделей мебели. Каждая продажа имеет отношение к одному договору.\nКроме того следует учесть:\n• каждый покупатель обязательно заключает договор. Каждый договор обязательно имеет отношение к покупателю;\n• модель мебели не обязательно может быть продана (может не иметь спроса). Каждая продажа обязательно соответствует некоторой модели мебели;\n• каждому договору обязательно соответствует хотя бы одна продажа. Каждая продажа обязательно соответствует некоторому договору.","label":[[412,427,"string"],[429,435,"string"],[437,458,"string"],[460,476,"double"],[493,507,"integer"],[509,528,"string"],[530,546,"string"],[548,566,"integer"],[599,613,"integer"],[615,629,"integer"],[631,655,"timestamp"],[657,681,"timestamp"],[695,709,"integer"],[711,726,"string"],[728,734,"string"],[736,747,"integer"]],"Comments":[]}
{"id":1380,"text":"Типография изготавливает полиграфическую продукцию различного рода: визитки, календари, буклеты и др. Необходимо спроектировать базу данных ТИПОГРАФИЯ, информация которой будет использоваться для учета заказов на изготовление полиграфической продукции.\nВ БД должна храниться информация:\n• о цехах типографии: номер цеха, название цеха, начальник цеха, телефон цеха;\n• продукции: код продукции, название продукции, номер цеха, стоимость единицы печатной продукции (руб.);\n• договорах на изготовление полиграфической продукции: номер договора, название заказчика, адрес заказчика, дата оформления договора, дата выполнения договора;\n• заказах: номер договора, код продукции, количество продукции (шт.).\nПри проектировании БД необходимо учитывать следующее:\n• в цехе могут изготавливаться несколько видов печатной продукции. Каждый вид печатной продукции изготавливается только одним цехом;\n• каждый вид печатной продукции может быть заказан несколько раз (по разным договорам). Заказ соответствует одному виду продукции;\n• договору могут соответствовать несколько заказов. Заказ имеет отношение к одному договору.\nКроме того следует учесть:\n• каждый цех обязательно изготавливает хотя бы один вид продукции. Каждый вид продукции обязательно изготавливается в некотором цехе;\n• продукция некоторого вида не обязательно может быть заказана (может не иметь спроса). Каждый заказ обязательно соответствует продукции некоторого вида;\n• каждому договору обязательно соответствует хотя бы один заказ. Каждый заказ обязательно имеет отношение к некоторому договору.","label":[[309,319,"integer"],[321,334,"string"],[336,350,"string"],[352,364,"integer"],[379,392,"integer"],[394,412,"string"],[414,424,"integer"],[426,462,"double"],[526,540,"integer"],[542,560,"string"],[562,577,"string"],[579,603,"timestamp"],[605,629,"timestamp"],[642,656,"integer"],[658,671,"integer"],[673,693,"integer"]],"Comments":[]}
{"id":1381,"text":"Аптечный склад РУП \"БелФармация\" осуществляет оптовую продажу лекарственных препаратов различным аптекам республики. Необходимо спроектировать базу данных АПТЕЧНЫЙ СКЛАД, информация которой будет использоваться для учета продаж аптекам лекарственных препаратов.\nВ БД должна храниться информация:\n• о лекарствах: код лекарства, название лекарства, производитель, цена (руб.);\n• аптеках: номер аптеки, название аптеки, адрес аптеки, номер телефона;\n• заявках: номер заявки, дата составления заявки, номер аптеки, дата выполнения заявки;\n• закупках лекарственных препаратов: номер заявки, код лекарства, количество (шт.).\nПри проектировании БД необходимо учитывать следующее:\n• аптека может составить несколько заявок. Заявка имеет отношение к одной аптеке;\n• лекарство может иметь отношение к нескольким закупкам. Закупка соответствует одному лекарству;\n• заявке могут соответствовать несколько закупок. Закупка соответствует одной заявке.\nКроме того следует учесть:\n• каждая аптека обязательно составляет хотя бы одну заявку. Каждая заявка обязательно имеет отношение к некоторой аптеке;\n• лекарство не обязательно может входить в закупку. Каждая закупка обязательно соответствует лекарству;\n• каждой заявке обязательно соответствует хотя бы одна закупка. Каждая закупка обязательно имеет отношение к заявке.","label":[[312,325,"integer"],[327,345,"string"],[347,360,"string"],[362,367,"double"],[386,398,"integer"],[400,415,"string"],[417,429,"string"],[431,445,"integer"],[458,470,"integer"],[472,495,"timestamp"],[497,509,"integer"],[511,533,"timestamp"],[572,584,"integer"],[586,599,"integer"],[601,612,"integer"]],"Comments":[]}
{"id":1382,"text":"В пункте обмена валюты ежедневно производится купля-продажа валюты. При совершении сделки покупается или продается валюта. Курс купли-продажи устанавливается Национальным банком республики. Необходимо спроектировать БД ПУНКТ ОБМЕНА ВАЛЮТЫ, которая должна обеспечивать хранение, поиск, анализ данных о сделках, совершенных в пункте обмена, и др.\nВ БД должна храниться информация:\n• о КЛИЕНТЕ: номер клиента, Ф.И.О. клиента, номер паспорта;\n• СДЕЛКЕ: код проданной валюты, код купленной валюты, номер кассира, номер клиента, дата сделки, время сделки, сумма проданной валюты, сумма купленной валюты;\n• ВАЛЮТЕ: код валюты, название валюты, курс продажи, курс покупки;\n• КАССИРЕ: номер кассира, Ф.И.О. кассира.\nПри проектировании БД необходимо учитывать следующее:\n• клиент может совершать несколько сделок. Сделка совершается одним клиентом;\n• любая валюта покупается (продается) при нескольких сделках. Сделка связана с одной валютой.\n• кассир обслуживает много сделок. Сделка совершается одним кассиром.\nКроме того следует учесть:\n• каждая сделка обязательно совершается клиентом. Клиент не обязательно совершает сделку (его может не устраивать курс валюты);\n• каждая сделка обязательно совершается при продаже (покупке) валюты. При совершении сделки обязательно продается или покупается валюта;\n• каждая сделка обязательно обслуживается кассиром. Кассир не обязательно обслуживает сделку (например, он только что принят на работу).","label":[[392,405,"integer"],[407,421,"string"],[423,437,"integer"],[449,469,"integer"],[471,491,"integer"],[493,506,"integer"],[508,521,"integer"],[523,534,"timestamp"],[536,548,"timestamp"],[550,572,"double"],[574,596,"double"],[608,618,"integer"],[620,635,"string"],[637,649,"double"],[651,663,"double"],[676,689,"integer"],[691,705,"string"]],"Comments":[]}
{"id":1383,"text":"Сотрудники научно-производственного предприятия \"Новые аналитические системы\" занимаются разработкой и поставкой программного обеспечения для разных организаций. Программное обеспечение позволяет управлять аналитическим оборудованием следующих типов: аналого-цифровым преобразователем (АЦП) NM с АМ1, АЦП NM без усилителя, АЦП NM с U2, АЦП NM с АМ2, АЦП NM с АМ1. При поставке программного обеспечения заключается договор с организацией. Если заключается договор на поставку программного обеспечения, которое разработал сотрудник, то он поощряется премией.\nНеобходимо спроектировать БД НАУЧНО-ПРОИЗВОДСТВЕННОЕ ПРЕДПРИЯТИЕ, информация которой будет использоваться для хранения данных о поставках программного обеспечения; организациях, в которые выполнены поставки; анализа деятельности сотрудников научно-производственного предприятия и др.\nВ БД должна храниться информация:\n• о СОТРУДНИКАХ: код сотрудника, код отдела, Ф.И.О. сотрудника, должность, оклад, премия;\n• ПОСТАВКАХ: номер договора, тип оборудования, комментарий пользователя о работе программного обеспечения (может отсутствовать);\n• ДОГОВОРАХ: номер договора; наименование организации, с которой заключен договор; дата заключения договора; код сотрудника;\n• ОРГАНИЗАЦИЯХ: код страны, город, адрес, телефон, e-mail, адрес web-сайта (может отсутствовать).\nПри проектировании БД необходимо учитывать следующее:\n• сотрудник заключает несколько договоров с разными организациями на поставку программного обеспечения. Договор на поставку программного обеспечения заключает один сотрудник предприятия;\n• поставка программного обеспечения предусматривает заключение одного договора. Договор соответствует одной поставке;\n• договор заключается с одной организацией. Организация заключает один договор.\nКроме того следует учесть:\n• сотрудник предприятия не обязательно заключают договор на поставку программного обеспечения (не устраивает договорная цена и др.). Каждый договор обязательно заключается сотрудником;\n• каждый договор обязательно заключается при поставке программного обеспечения различным организациям. Каждая поставка обязательно предусматривает заключение договора;\n• каждая поставка программного обеспечения обязательно производится организациям. Каждой организации обязательно соответствует поставка программного обеспечения.","label":[[892,906,"integer"],[908,918,"integer"],[920,937,"string"],[939,948,"string"],[950,955,"double"],[957,963,"double"],[978,992,"integer"],[994,1010,"string"],[1012,1070,"string"],[1107,1121,"integer"],[1123,1147,"string"],[1177,1201,"timestamp"],[1203,1217,"integer"],[1235,1245,"integer"],[1247,1252,"string"],[1254,1259,"string"],[1261,1268,"integer"],[1270,1276,"string"],[1278,1293,"string"]],"Comments":[]}
{"id":1384,"text":"Абонемент библиотеки производит выдачу книг читателям и прием книг в библиотеку от читателей. В библиотеке ведутся тематические каталоги. В тематическом каталоге отображается перечень тем, относящихся к одной области знаний. Необходимо спроектировать базу данных АБОНЕМЕНТ БИБЛИОТЕКИ, которая должнаобеспечивать хранение данных о выдаче и возврате книг в библиотеку; анализе данных о должниках библиотеки и книгах, популярных среди читателей, и др.\nВ БД должна храниться информация:\n• о КНИГАХ: шифр книги, ее название, первый автор, издательство, место издания, год издания, количество страниц, цена (руб.);\n• ЭКЗЕМПЛЯРАХ: шифр книги; инвентарный номер; дата выдачи; дата возврата;\n• ЧИТАТЕЛЯХ: номер читательского билета, Ф.И.О. читателя, дата рождения, телефон;\n• ТЕМАТИЧЕСКИХ КАТАЛОГАХ, где содержатся данные о кодах тем и наименованиях тем.\nПри проектировании БД необходимо учитывать следующее:\n• читатель одновременно работает с несколькими экземплярами. С одним экземпляром может работать только один читатель;\n• книга имеется в библиотеке в нескольких экземплярах. Экземпляр соответствует одной книге;\n• книга может содержаться в нескольких тематических каталогах. В тематическом каталоге содержатся сведения о нескольких книгах.\nКроме того следует учесть:\n• читатель не обязательно работает с книгой (отсутствует необходимая литература и др.). Книга не обязательно востребуется читателем;\n• каждая книга обязательно имеет экземпляр. Каждый экземпляр обязательно соответствует книге;\n• каждая книга обязательно содержится в тематическом каталоге. Каждый тематический каталог обязательно содержит сведения о книге.","label":[[495,505,"string"],[510,518,"string"],[520,532,"string"],[534,546,"string"],[548,561,"string"],[563,574,"integer"],[576,594,"integer"],[596,601,"double"],[624,634,"string"],[636,653,"integer"],[655,666,"timestamp"],[668,681,"timestamp"],[696,722,"integer"],[724,739,"string"],[741,754,"timestamp"],[756,763,"integer"],[815,824,"integer"],[827,844,"string"]],"Comments":[]}
{"id":1385,"text":"Коммерческие фирмы (Авто, Атлант-М и др.) занимаются поставкой различных моделей автомобилей. Модель имеет свои технические характеристики и может быть отгружена нескольким клиентам. Необходимо спроектировать базу данных КОММЕРЧЕСКАЯ ФИРМА, котораядолжна обеспечивать хранение и поиск данных о наличии необходимых моделей автомобилей; сделках, совершаемых сотрудниками фирмы; выявлять модели автомобилей, пользующихся наибольшим спросом у клиентов, и др.\nВ БД должна храниться информация:\n• о ПОСТАВЩИКАХ: код фирмы, название фирмы, телефон, e-mail, адрес web-сайта (может отсутствовать);\n• МОДЕЛЯХ: код модели, наименование модели, цвет, обивка, мощность двигателя (например, 100\/139 кВт), количество дверей, коробка передач (ручная или автоматическая);\n• КЛИЕНТАХ: Ф.И.О. клиента, телефон, адрес, код модели;\n• ПРЕЙСКУРАНТЕ ЦЕН: код модели, год выпуска, цена (у.е.), предпродажная подготовка (стоимость услуг по подготовке к продаже, у.е.), транспортные издержки (у.е.);\n• ПРОДАЖАХ: номер договора, код модели, номер клиента, дата покупки.\nПри проектировании БД необходимо учитывать следующее:\n• поставщик предлагает несколько моделей автомобилей. Модель автомобиля может быть предложена нескольким поставщикам;\n• модель автомобиля соответствует одному прейскуранту цен. Прейскурант цен соответствует только одной модели;\n• клиент покупает несколько моделей автомобилей. Модель покупают несколько клиентов;\n• продажа совершается одному клиенту, клиент может совершить несколько покупок.\nКроме того следует учесть:\n• каждый поставщик обязательно предлагает модели автомобилей. Каждая модель обязательно предлагается поставщиком;\n• модель автомобиля не обязательно покупается клиентом (не понравился цвет модели и т.д.). Клиент не обязательно покупает модель (не устраивают технические характеристики автомобиля);\n• каждая модель автомобиля обязательно имеет прейскурант цен. Каждый прейскурант цен обязательно соответствует модели автомобиля.","label":[[506,515,"integer"],[517,531,"string"],[533,540,"integer"],[542,548,"string"],[550,565,"string"],[600,610,"integer"],[612,631,"string"],[633,637,"string"],[639,645,"string"],[647,665,"string"],[691,708,"integer"],[710,725,"string"],[767,781,"string"],[783,790,"integer"],[792,797,"string"],[799,809,"integer"],[831,841,"integer"],[843,854,"integer"],[856,861,"double"],[869,893,"double"],[943,964,"double"],[985,999,"integer"],[1001,1011,"integer"],[1013,1026,"integer"],[1028,1040,"timestamp"]],"Comments":[]}
{"id":1386,"text":"Студенты высших учебных заведений на последнем курсе сдают госэкзамены (количество варьируется в зависимости от вуза), пишут и защищают дипломную работу. При написании дипломной работы выбирают тему дипломной работы и руководителя. Необходимо спроектировать базу данных ДИПЛОМНЫЙ ПРОЕКТ, информация которой будет использоваться для хранения и поиска данных о научных темах, которые предложены студентам-дипломникам, успеваемости студентов и др.\nВ БД должна храниться информация:\n• о СТУДЕНТАХ: номер зачетной книжки, Ф.И.О. студента, факультет, группа;\n• ТЕМАХ: код преподавателя, тема дипломной работы;\n• ОТМЕТКАХ: номер зачетной книжки; оценка, полученная на госэкзамене, оценка, полученная на защите дипломной работы;\n• ПРЕПОДАВАТЕЛЯХ: код преподавателя, Ф.И.О. преподавателя, степень, звание, кафедра, телефон, e-mail.\nПри проектировании БД необходимо учитывать следующее:\n• преподаватель для руководства студентами-дипломниками предлагает несколько тем дипломных работ. Тема дипломной работы может быть предложена только одним преподавателем;\n• студент выбирает одну тему дипломной работы. Тема может быть выбрана только одним студентом.\n• студент получает одну отметку. Отметка соответствует одному студенту.\nКроме того следует учесть:\n• преподаватель не обязательно предлагает тему дипломной работы (он может не иметь научной степени или научного звания, необходимых для руководителя дипломной работы). Каждая тема обязательно предлагается преподавателем для написания дипломной работы;\n• каждый студент обязательно выбирает тему для написания дипломной работы. Тема не обязательно выбирается студентом;\n• каждый студент обязательно получает отметку. Каждая отметка обязательно соответствует студенту.","label":[[494,515,"integer"],[517,532,"string"],[534,543,"string"],[545,551,"string"],[562,579,"integer"],[581,602,"string"],[616,637,"integer"],[639,645,"integer"],[674,680,"integer"],[739,756,"integer"],[758,778,"string"],[780,787,"string"],[789,795,"string"],[797,804,"string"],[806,813,"integer"],[815,821,"string"]],"Comments":[]}
{"id":1387,"text":"Издательский центр \"Печать\" заключает с писателями контракты на издание книг. В течение срока контракта писатели работают только с этим центром и могут объединяться в творческие группы для совместного написания книг. Издательскийцентр может расторгнуть или перезаключить контракт с писателем на новый срок. Центр издает написанные книги и продает их заказчикам: организациям, магазинам, библиотекам и др. За изданные книги писатели получают гонорары. Необходимо спроектировать базу данных Издательский центр, информация которой будет использоваться для определения гонораров писателям за изданные книги, исчисления срока контракта с писателями, количества написанных книг писателем за время контракта, затрат на издание книг, прибыли от продажи книг и др.\nВ БД должна храниться информация:\n• о писателях: номер паспорта, фамилия, имя, отчество, домашний адрес, телефон;\n• контрактах: номер контракта, дата заключения контракта, срок контракта (лет), контракт расторгнут или не расторгнут (Да\/Нет), дата расторжения контракта;\n• книгах: шифр книги, название, тираж, дата выхода из печати, себестоимость (руб.), цена продажи (руб.), гонорар (на всех авторов книги, тыс. руб.);\n• заказчиках: название заказчика, адрес, телефон, обращаться к (Ф.И.О.);\n• заказах: номер заказа, дата поступления заказа, дата выполнения заказа, количество экземпляров заказываемой книги.\nПри проектировании БД необходимо учитывать следующее:\n• писателю соответствует один контракт (в случае перезаключения контракта прежний контракт заменяется новым). Контракт заключается с одним писателем;\n• писатель может написать несколько книг. Книга может быть написана несколькими писателями;\n• на книгу может быть сделано несколько заказов. Заказ оформляется на одну книгу;\n• заказчик может сделать несколько заказов. Заказ оформляется на одного заказчика.\nКроме того следует учесть:\n• каждому писателю обязательно соответствует контракт. Каждый контракт обязательно заключается с писателем;\n• писатель не обязательно пишет книгу (он заключил контракт, но по какой-то причине не пишет книгу). Каждая книга обязательно пишется одним или несколькими писателями;\n• на книгу не обязательно делается заказ (она может быть не востребована заказчиками). Каждый заказ обязательно оформляется на книгу;\n• каждый заказчик обязательно делает заказ. Каждый заказ обязательно оформляется на заказчика.","label":[[805,819,"integer"],[821,828,"string"],[830,833,"string"],[835,843,"string"],[845,859,"string"],[861,868,"integer"],[884,899,"integer"],[901,926,"timestamp"],[928,942,"integer"],[950,987,"boolean"],[998,1024,"timestamp"],[1036,1046,"string"],[1048,1056,"string"],[1058,1063,"integer"],[1065,1086,"timestamp"],[1088,1101,"double"],[1110,1122,"double"],[1131,1138,"double"],[1189,1207,"string"],[1209,1214,"string"],[1216,1223,"integer"],[1225,1237,"string"],[1259,1271,"integer"],[1273,1296,"timestamp"],[1298,1320,"timestamp"],[1322,1344,"integer"]],"Comments":[]}
{"id":1388,"text":"Задание 27. Проект АВИАЛИНИИ\nАвиакомпания \"Полет\" занимается авиаперевозками пассажиров. Авиакомпанией установлены маршруты полетов: Минск-Франкфурт, Минск-Рига и др. Рейсы осуществляются по установленным маршрутам согласно расписанию. За каждым самолетом закреплен командир корабля. Необходимо спроектировать базу данных Авиалинии, информация которой будет использоваться для определения доходов, приносимых рейсами, даты и времени прибытия самолета в аэропорт назначения, истечения срока эксплуатации самолета и др.\nВ БД должна храниться информация:\n• о Маршрутах: номер маршрута, аэропорт вылета, аэропорт назначения, цена билета на маршрут (руб.), продолжительность полета (мин.);\n• рейсах: номер рейса, дата и время вылета, рейс отменен или не отменен (Да\/Нет);\n• пассажирах: номер паспорта, Ф.И.О. пассажира, адрес, телефон;\n• самолетах: бортовой номер, модель (Боинг-747, Ту-134, Ил-62 и др.), дата изготовления, срок эксплуатации (лет), готовность или не готовность к вылету (Да\/Нет, \"Да\" означает, что самолет находится в исправном состоянии и готов к вылету);\n• командирах корабля: личный номер, Ф.И.О. командира, адрес, телефон, налет (часов).\nПри проектировании БД необходимо учитывать следующее:\n• по маршруту могут осуществляться несколько рейсов. Рейс осуществляется по одному маршруту;\n• пассажир может купить билеты на несколько рейсов. Одним и тем же рейсом могут лететь несколько пассажиров;\n• самолет может назначаться на несколько рейсов. На рейс назначается один самолет;\n• у самолета один командир корабля. Командир корабля закреплен за одним самолетом.\nКроме того следует учесть:\n• по каждому маршруту обязательно осуществляется один или несколько рейсов. Каждый рейс обязательно осуществляется по некоторому маршруту;\n• каждый пассажир обязательно летит рейсом. Рейс не обязательно имеет пассажиров (ни один пассажир не купил билет на рейс. В этом случае рейс отменяется);\n• каждый самолет обязательно назначается на рейс. Каждому рейсу обязательно назначается самолет;\n• у каждого самолета обязательно есть командир корабля. Каждый командир корабля обязательно закрепляется за самолетом.","label":[[567,581,"integer"],[583,598,"string"],[600,619,"string"],[621,643,"double"],[652,676,"integer"],[695,706,"integer"],[708,712,"timestamp"],[715,721,"timestamp"],[729,756,"boolean"],[781,795,"integer"],[797,813,"string"],[815,820,"string"],[822,829,"integer"],[844,858,"integer"],[860,867,"string"],[900,918,"timestamp"],[920,937,"integer"],[945,982,"boolean"],[1092,1104,"integer"],[1106,1122,"string"],[1124,1129,"string"],[1131,1138,"integer"],[1140,1146,"integer"]],"Comments":[]}
{"id":1389,"text":"Фирмы – поставщики автомобильного топлива – \"Белнефтехим\", \"Славнефть\", \"А-100\", \"Лукойл\" имеют сеть заправочных автостанций в Республике Беларусь. На автозаправках реализуется за безналичный расчет с помощью специальных пластиковых карт автомобильное топливо всех видов – бензин-76, бензин-92, бензин-95, бензин-96, дизельное топливо, газ. Необходимо спроектировать базу данных Автозаправки, информация которой будет использоваться для анализа продаж автомобильного топлива за безналичный расчет клиентам по видам топлива в сети заправок конкретной фирмы-производителя, продаж различных видов топлива клиентам по всем заправочным станциям, спроса на автомобильное топливо в динамике за определенные промежутки времени и др.\nВ БД должна храниться информация:\n• о Клиентах: карт-счет клиента, Ф.И.О. клиента, адрес, телефон;\n• Автозаправках: код автозаправки, название фирмы, адрес автозаправки;\n• Фирмах: название фирмы, юридический адрес, телефон;\n• Топливе: код топлива, вид топлива, единица измерения, цена (руб.);\n• ежедневной Продаже топлива клиентам: дата продажи, карт-счет клиента, код автозаправки, код топлива, количество (в натуральном выражении).\nПри проектировании БД необходимо учитывать следующее:\n• фирма имеет несколько автозаправок. Автозаправка принадлежит только одной фирме;\n• фирма предоставляет несколько видов топлива. Каждый вид топлива предоставляется несколькими фирмами;\n• каждый вид топлива связан с несколькими продажами. Продажа связана с одним видом топлива;\n• на автозаправке осуществляются несколько продаж. Продажа топлива связана с одной автозаправкой;\n• с клиентом могут быть связаны несколько продаж. Продажа связана только с одним клиентом.\nКроме того следует учесть:\n• каждая фирма обязательно имеет автозаправки. Каждая автозаправка обязательно принадлежит определенной фирме;\n• каждая фирма обязательно предоставляет топливо. Каждый вид топлива обязательно поставляется фирмами;\n• топливо некоторого вида не обязательно связано с продажами. Каждая продажа обязательно связана с топливом некоторого вида;\n• на каждой заправке обязательно осуществляются продажи топлива. Каждая продажа обязательно связана с автозаправкой;\n• с клиентом не обязательно связаны продажи топлива (клиент может не осуществлять покупки топлива). Каждая продажа топлива обязательно связана с клиентом.","label":[[773,790,"integer"],[792,806,"string"],[808,813,"string"],[815,822,"integer"],[841,857,"integer"],[859,873,"string"],[875,894,"string"],[905,919,"string"],[921,938,"string"],[940,947,"integer"],[960,971,"integer"],[973,984,"string"],[986,1003,"integer"],[1005,1010,"double"],[1057,1069,"timestamp"],[1071,1088,"integer"],[1090,1106,"integer"],[1108,1119,"integer"],[1121,1132,"integer"]],"Comments":[]}
{"id":1390,"text":"ЗАО \"Витекс\" выпускает различную косметическую продукцию: кремы, шампуни, бальзамы и др. Некоторые наборы косметических средств составляют одну линию-бренд: \"Кислородная линия\", \"Красота от природы\", \"Афродита\" и др. Предприятия торговли и сервиса осуществляют заказы у ЗАО \"Витекс\" на поставку им определенных видов продукции с указанием необходимого количества и даты поставки по мере продаж и расходования предыдущих партий. ЗАО \"Витекс\" выполняет заказы каждого предприятия разовой доставкой или несколькими доставками по частям от заказанного количества в течение указанного срока исполнения заказов. Необходимо спроектировать базу данных Косметическая продукция, информация которой будет использоваться для хранения информации о номенклатуре выпускаемых косметических средств, анализа спроса на отдельные виды и линии косметических средств, учета поступления и исполнения заказов предприятий в заданные сроки и др.\nВ БД должна храниться информация:\n• о Товарах: код товара, наименование товара, код бренда, единица измерения, цена (руб.);\n• Брендах: код бренда, наименование бренда;\n• Предприятиях: код предприятия, наименование предприятия, адрес, телефон;\n• Заказах: код заказа, код предприятия, код товара, количество товара в заказе, дата заказа, дата к исполнению;\n• Доставках: код заказа, дата фактического исполнения заказа, количество товара в доставке.\nПри проектировании БД необходимо учитывать следующее:\n• бренд включает несколько наименований товаров. Товар может принадлежать только одному бренду;\n• товар может содержаться в нескольких заказах. Заказ связан с одним видом товара;\n• предприятие может осуществлять несколько заказов. Заказ связан с одним предприятием;\n• заказ может быть исполнен несколькими доставками по частям от требуемого количества продукции. Доставка связана с одним заказом.\nКроме того следует учесть:\n• каждый бренд обязательно включает несколько наименований товаров. Товар не обязательно принадлежит какому-либо бренду;\n• товар не обязательно должен быть заказан. Каждый заказ обязательно связан с определенным товаром;\n• предприятие не обязательно осуществляет заказы. Каждый заказ обязательно осуществляется некоторым предприятием;\n• заказ не обязательно может быть исполнен (доставлен). Каждая доставка обязательно связана с заказом товара.","label":[[968,978,"integer"],[980,999,"string"],[1001,1011,"integer"],[1013,1030,"string"],[1032,1037,"double"],[1056,1066,"integer"],[1068,1087,"string"],[1105,1120,"integer"],[1122,1146,"string"],[1148,1153,"string"],[1155,1162,"integer"],[1175,1185,"integer"],[1187,1203,"integer"],[1204,1214,"integer"],[1216,1242,"integer"],[1244,1255,"timestamp"],[1257,1274,"timestamp"],[1289,1299,"integer"],[1301,1336,"timestamp"],[1338,1366,"integer"]],"Comments":[]}
{"id":1391,"text":"Предприятие \"Минскзеленстрой\" в весенне-летний период осуществляет выполнение заказов на цветочное оформление парков, площадей, прилегающих территорий предприятий и организаций столицы (заказчиков): Мингорисполкома, БГЭУ, МТЗ и др. Для цветочного оформления используется рассада различных цветов: агератум, гортензия, петуния и др. Предприятию \"Минскзеленстрой\" рассаду цветов поставляют селекционеры различных предприятий: \"Цветы столицы\", \"Цветочные композиции\", \"Цветники\" и др. Необходимо спроектировать базу данных МИНСКЗЕЛЕНСТРОЙ, информация которой будет использоваться для учета на предприятии поставляемой рассады цветов, расчета стоимости заказов на цветочное оформление и др.\nВ БД должна храниться информация:\n• о поставщиках рассады цветов: код поставщика, название поставщика, адрес поставщика;\n• цветах: код цветка, название цветка, код поставщика, цена рассады (руб.);\n• заказчиках: код заказчика, название заказчика, адрес заказчика, телефон;\n• договорах: номер договора, код заказчика, дата оформления договора, дата исполнения договора;\n• заказах (о цветах, используемых для выполнения договора): номер договора, код цветка, количество рассады (шт.).\nПри проектировании БД необходимо учитывать следующее:\n• поставщик поставляет несколько видов цветов. Цветок некоторого вида поставляется только одним поставщиком;\n• заказчик может заключить несколько договоров. Каждый договор заключается одним заказчиком;\n• договору могут соответствовать несколько заказов. Каждый заказ имеет отношение к одному договору;\n• каждый вид цветка может участвовать в нескольких заказах. Каждый заказ имеет отношение к одному виду цветка.\nКроме того следует учесть:\n• каждый поставщик обязательно поставляет рассаду хотя бы одного цветка. Каждый вид цветка обязательно поставляется одним из поставщиков;\n• каждый заказчик обязательно заключает хотя бы один договор. Каждый договор обязательно имеет заказчика;\n• каждому договору обязательно соответствует хотя бы один заказ. Каждый заказ обязательно соответствует некоторому договору;\n• поставляемый цветок не обязательно может иметь заказ (на него нет спроса). Каждый заказ обязательно соответствует некоторому виду цветка.","label":[[818,828,"integer"],[830,845,"string"],[847,861,"integer"],[863,875,"double"],[898,911,"integer"],[913,931,"string"],[933,948,"string"],[950,957,"integer"],[972,986,"integer"],[988,1001,"integer"],[1003,1027,"timestamp"],[1029,1053,"timestamp"],[1115,1129,"integer"],[1131,1141,"integer"],[1143,1161,"integer"]],"Comments":[]}
{"id":1392,"text":"Задание: Разработать логическую модель базы данных для интернет-магазина, включающую информацию о товарах, заказах, клиентах и доставке. Определить структуру таблиц:\n   - Товары: артикул, название, описание, цена, количество на складе, категория, производитель.\n   - Заказы: номер заказа, дата заказа, статус заказа, клиент, адрес доставки, стоимость заказа.\n   - Клиенты: ФИО, контактные данные (телефон, email), адрес доставки.\n   - Доставка: номер заказа, дата доставки, статус доставки, курьер, адрес доставки.","label":[[179,186,"integer"],[188,196,"string"],[198,206,"string"],[208,212,"double"],[214,234,"integer"],[236,245,"string"],[247,260,"string"],[275,287,"integer"],[289,300,"timestamp"],[302,315,"string"],[317,323,"string"],[325,339,"string"],[341,357,"double"],[373,376,"string"],[378,395,"string"],[414,428,"string"],[445,457,"integer"],[459,472,"timestamp"],[474,489,"string"],[491,497,"string"],[499,513,"string"]],"Comments":[]}
{"id":1393,"text":"Задание: Создать логическую модель базы данных для системы управления персоналом, содержащую информацию о сотрудниках, их должностях, зарплатах и отпусках. Определить структуру таблиц:\n   - Сотрудники: ФИО, дата рождения, контактные данные (телефон, email), должность.\n   - Должности: название должности, описание, уровень зарплаты.\n   - Зарплаты: ФИО сотрудника, должность, дата начисления зарплаты, сумма зарплаты.\n   - Отпуска: ФИО сотрудника, дата начала отпуска, дата окончания отпуска, количество дней отпуска.","label":[[202,205,"string"],[207,220,"timestamp"],[222,239,"string"],[258,267,"string"],[285,303,"string"],[305,313,"string"],[315,331,"double"],[348,362,"string"],[364,373,"string"],[375,399,"timestamp"],[401,415,"double"],[431,445,"string"],[447,466,"timestamp"],[468,490,"timestamp"],[492,515,"integer"]],"Comments":[]}
{"id":1394,"text":"Разработать логическую модель базы данных для системы управления складом, включающую информацию о товарах, их наличии на складе, поставщиках и заказах на поставку. Структура таблиц:\n- Товары: артикул, название, описание, единица измерения, минимальный остаток, максимальный остаток.\n- Наличие на складе: артикул товара, количество на складе.\n- Поставщики: название поставщика, контактные данные (телефон, email), адрес.\n- Заказы на поставку: номер заказа, дата заказа, статус заказа, поставщик, товары в заказе, количество товаров, стоимость заказа.","label":[[192,199,"integer"],[201,209,"string"],[211,219,"string"],[221,238,"string"],[240,259,"integer"],[261,281,"integer"],[304,318,"integer"],[320,340,"integer"],[356,375,"string"],[377,394,"string"],[413,418,"string"],[442,454,"integer"],[456,467,"timestamp"],[469,482,"string"],[484,493,"string"],[495,510,"string"],[512,530,"integer"],[532,548,"double"]],"Comments":[]}
{"id":1395,"text":"Создать логическую модель базы данных для системы управления библиотекой, содержащую информацию о книгах, читателях, выданных книгах и сроках возврата. Структура таблиц:\n- Книги: ISBN, название, автор, количество страниц, жанр.\n- Читатели: ФИО, контактные данные (телефон, email), адрес.\n- Выданные книги: ISBN книги, ФИО читателя, дата выдачи, дата возврата.","label":[[179,183,"integer"],[185,193,"string"],[195,200,"string"],[202,220,"integer"],[222,226,"string"],[240,243,"string"],[245,262,"string"],[281,286,"string"],[306,316,"integer"],[318,330,"string"],[332,343,"timestamp"],[345,358,"timestamp"]],"Comments":[]}
{"id":1396,"text":"Разработать логическую модель базы данных для системы управления медицинской клиникой, включающую информацию о пациентах, врачах, назначениях и результатах анализов. Структура таблиц:\n- Пациенты: ФИО, дата рождения, контактные данные (телефон, email), адрес.\n- Врачи: ФИО, специализация, опыт работы.\n- Назначения: ФИО пациента, ФИО врача, дата назначения, диагноз, рекомендации.\n- Результаты анализов: ФИО пациента, дата анализа, результат анализа.","label":[[196,199,"string"],[201,214,"timestamp"],[216,233,"string"],[252,257,"string"],[268,271,"string"],[273,286,"string"],[288,299,"integer"],[315,327,"string"],[329,338,"string"],[340,355,"timestamp"],[357,364,"string"],[366,378,"string"],[403,415,"string"],[417,429,"timestamp"],[431,448,"string"]],"Comments":[]}
{"id":1397,"text":"Создать логическую модель базы данных для системы управления рестораном, содержащую информацию о блюдах, заказах, клиентах и сотрудниках. Структура таблиц:\n- Блюда: название, описание, цена.\n- Заказы: номер заказа, дата заказа, статус заказа, клиент, блюда в заказе, количество блюд, стоимость заказа.\n- Клиенты: ФИО, контактные данные (телефон, email), адрес.\n- Сотрудники: ФИО, должность, контактные данные (телефон, email).","label":[[165,173,"string"],[175,183,"string"],[185,189,"double"],[201,213,"integer"],[215,226,"timestamp"],[228,241,"string"],[243,249,"string"],[251,265,"string"],[267,282,"integer"],[284,300,"double"],[313,316,"string"],[318,335,"string"],[354,359,"string"],[375,378,"string"],[380,389,"string"],[391,408,"string"]],"Comments":[]}
{"id":1398,"text":"Создать логическую модель базы данных для системы управления гостиницей, включающую информацию о номерах, гостях, бронировании и услугах. Структура таблиц:\n- Номера: номер комнаты, тип номера, количество мест, стоимость.\n- Гости: ФИО, контактные данные (телефон, email), адрес.\n- Бронирование: номер бронирования, дата бронирования, статус бронирования, гость, номер комнаты, количество дней.\n- Услуги: название услуги, описание, стоимость.","label":[[166,179,"integer"],[181,191,"string"],[193,208,"integer"],[210,219,"double"],[230,233,"string"],[235,252,"string"],[271,276,"string"],[294,312,"integer"],[314,331,"timestamp"],[333,352,"string"],[354,359,"string"],[361,374,"integer"],[376,391,"integer"],[403,418,"string"],[420,428,"string"],[430,439,"double"]],"Comments":[]}
{"id":1399,"text":"Создать логическую модель базы данных для системы управления курьерской службой, включающую информацию о заказах, курьерах, маршрутах и доставке. Структура таблиц:\n- Заказы: номер заказа, дата заказа, статус заказа, клиент, адрес доставки, стоимость заказа.\n- Курьеры: ФИО, контактные данные (телефон, email), адрес.\n- Маршруты: номер маршрута, дата маршрута, список адресов доставки.\n- Доставка: номер заказа, дата доставки, статус доставки, курьер, адрес доставки.","label":[[174,186,"integer"],[188,199,"timestamp"],[201,214,"string"],[216,222,"string"],[224,238,"string"],[240,256,"double"],[269,272,"string"],[274,291,"string"],[310,315,"string"],[329,343,"integer"],[345,358,"timestamp"],[360,383,"string"],[397,409,"integer"],[411,424,"timestamp"],[426,441,"string"],[443,449,"string"],[451,465,"string"]],"Comments":[]}
{"id":1400,"text":"Разработать логическую модель базы данных для системы управления автосервисом, включающую информацию о клиентах, автомобилях, ремонтных работах и запчастях. Структура таблиц:\n- Клиенты: ФИО, контактные данные (телефон, email), адрес.\n- Автомобили: VIN-код, марка, модель, год выпуска, пробег.\n- Ремонтные работы: номер заказа, дата заказа, статус заказа, клиент, автомобиль, описание работ, стоимость работ.\n- Запчасти: номер заказа, дата заказа, статус заказа, клиент, автомобиль, название запчасти, количество запчастей, стоимость запчастей.","label":[[186,189,"string"],[191,208,"string"],[227,232,"string"],[248,255,"integer"],[257,262,"string"],[264,270,"string"],[272,283,"integer"],[285,291,"integer"],[313,325,"integer"],[327,338,"timestamp"],[340,353,"string"],[355,361,"string"],[363,373,"string"],[375,389,"string"],[391,406,"double"],[420,432,"integer"],[434,445,"timestamp"],[447,460,"string"],[462,468,"string"],[470,480,"string"],[482,499,"string"],[501,521,"integer"],[523,542,"double"]],"Comments":[]}
{"id":1401,"text":"Создать логическую модель базы данных для системы управления кинотеатром, включающую информацию о фильмах, сеансах, билетах и зрителях. Структура таблиц:\n- Фильмы: название, описание, жанр, продолжительность, рейтинг.\n- Сеансы: номер сеанса, дата и время сеанса, название фильма, количество мест.\n- Билеты: номер билета, номер сеанса, ФИО зрителя, стоимость билета.\n- Зрители: ФИО, контактные данные (телефон, email), адрес.","label":[[164,172,"string"],[174,182,"string"],[184,188,"string"],[190,207,"integer"],[209,216,"double"],[228,240,"integer"],[242,247,"timestamp"],[249,255,"timestamp"],[263,278,"string"],[280,295,"integer"],[307,319,"integer"],[321,333,"integer"],[335,346,"string"],[348,364,"double"],[377,380,"string"],[382,399,"string"],[418,423,"string"]],"Comments":[]}
{"id":1402,"text":"Проект: Создание базы данных для учета клиентов и заказов в интернет-магазине.\nПредметная область: Интернет-магазин, продающий товары для дома.\nСущности: Клиент, Заказ, Товар.\nАтрибуты:\n- Клиент: ФИО, адрес, телефон, email.\n- Заказ: Дата заказа, статус заказа, сумма заказа.\n- Товар: Название, цена, количество.","label":[[196,199,"string"],[201,206,"string"],[208,215,"integer"],[217,222,"string"],[233,244,"timestamp"],[246,259,"string"],[261,273,"double"],[284,292,"string"],[294,298,"double"],[300,310,"integer"]],"Comments":[]}
{"id":1403,"text":"Задание: Создать логическую модель базы данных для системы управления задачами.\nСистема управления задачами предназначена для организации и контроля выполнения задач в команде. Она позволяет создавать задачи, назначать ответственных, устанавливать сроки выполнения, отслеживать прогресс и оставлять комментарии.\nЛогическая модель базы данных должна включать следующие элементы:\n1. Таблица \"Задачи\" с полями:\n   - Идентификатор задачи (ID)\n   - Название задачи\n   - Описание задачи\n   - Ответственный за задачу\n   - Дата создания задачи\n   - Дата завершения задачи\n   - Статус задачи (в процессе, выполнена, отменена)\n2. Таблица \"Комментарии\" с полями:\n   - Идентификатор комментария (ID)\n   - Идентификатор задачи (ID)\n   - Автор комментария\n   - Текст комментария\n   - Дата создания комментария\n3. Таблица \"Статусы\" с полями:\n   - Идентификатор статуса (ID)\n   - Название статуса\n4. Таблица \"Ответственные\" с полями:\n   - Идентификатор ответственного (ID)\n   - Имя ответственного\n   - Фамилия ответственного\n5. Таблица \"Связи\" с полями:\n   - Идентификатор задачи (ID)\n   - Идентификатор ответственного (ID)\nПри создании логической модели базы данных необходимо учесть следующие требования:\n1. Каждая задача должна иметь уникальное название и описание.\n2. Каждая задача должна быть связана с ответственным за ее выполнение.\n3. Каждая задача должна иметь дату создания и дату завершения.\n4. Каждая задача может иметь несколько комментариев.\n5. Каждая задача может иметь несколько ответственных.\n6. Каждая задача может иметь несколько статусов.","label":[[413,433,"integer"],[444,459,"string"],[465,480,"string"],[486,509,"string"],[515,535,"timestamp"],[541,563,"timestamp"],[569,582,"string"],[657,682,"integer"],[693,713,"integer"],[724,741,"string"],[747,764,"string"],[770,795,"timestamp"],[832,853,"integer"],[864,880,"string"],[923,951,"integer"],[962,980,"string"],[986,1008,"string"],[1043,1063,"integer"],[1074,1102,"integer"]],"Comments":[]}
{"id":1404,"text":"Создайте логическую модель базы данных для системы управления складом.\nСистема управления складом предназначена для учета товаров на складе, контроля их движения и отслеживания запасов. Она позволяет добавлять товары на склад, проводить инвентаризацию, отслеживать перемещение товаров между складами и продавать товары.\nЛогическая модель базы данных должна включать следующие элементы:\n1. Таблица \"Товары\" с полями:\n   - Идентификатор товара (ID)\n   - Название товара\n   - Описание товара\n   - Единица измерения товара\n   - Цена товара\n   - Количество товара на складе\n   - Дата добавления товара на склад\n2. Таблица \"Склады\" с полями:\n   - Идентификатор склада (ID)\n   - Название склада\n   - Адрес склада\n3. Таблица \"Поставщики\" с полями:\n   - Идентификатор поставщика (ID)\n   - Название поставщика\n   - Адрес поставщика\n4. Таблица \"Заказы\" с полями:\n   - Идентификатор заказа (ID)\n   - Дата заказа\n   - Идентификатор поставщика (ID)\n   - Идентификатор склада (ID)\n   - Название товара\n   - Количество товара\n5. Таблица \"Перемещения\" с полями:\n   - Идентификатор перемещения (ID)\n   - Дата перемещения\n   - Идентификатор склада (ID)\n   - Идентификатор товара (ID)\n   - Количество товара\n   - Идентификатор склада назначения (ID)\nПри создании логической модели базы данных необходимо учесть следующие требования:\n1. Каждый товар должен иметь уникальное название и описание.\n2. Каждый товар должен быть связан с единицей измерения и ценой.\n3. Каждый товар должен иметь информацию о количестве на складе и дате добавления на склад.\n4. Каждый склад должен иметь уникальное название и адрес.\n5. Каждый заказ должен быть связан с поставщиком и складом.\n6. Каждый заказ должен содержать информацию о названии товара и количестве.\n7. Каждый заказ должен быть связан с перемещением товара на склад.\n8. Каждый перемещение должен содержать информацию о количестве товара, складе назначения и дате перемещения.","label":[[421,441,"integer"],[452,467,"string"],[473,488,"string"],[494,518,"string"],[524,535,"double"],[541,568,"integer"],[574,605,"timestamp"],[641,661,"integer"],[672,687,"string"],[693,705,"string"],[746,769,"integer"],[780,799,"string"],[805,821,"string"],[857,877,"integer"],[888,899,"timestamp"],[905,929,"integer"],[940,960,"integer"],[971,986,"string"],[992,1009,"integer"],[1050,1074,"integer"],[1086,1102,"timestamp"],[1108,1128,"integer"],[1139,1159,"integer"],[1170,1187,"integer"],[1193,1224,"integer"]],"Comments":[]}
{"id":1405,"text":"Задача: Создать логическую модель базы данных для системы управления учебным процессом.\nСистема управления учебным процессом предназначена для организации и контроля учебного процесса в образовательном учреждении. Она позволяет создавать учебные планы, назначать преподавателей, регистрировать студентов, отслеживать успеваемость и оставлять комментарии.\nЛогическая модель базы данных должна включать следующие элементы:\n1. Таблица \"Учебные планы\" с полями:\n   - Идентификатор учебного плана (ID)\n   - Название учебного плана\n   - Описание учебного плана\n   - Дата создания учебного плана\n   - Дата завершения учебного плана\n2. Таблица \"Преподаватели\" с полями:\n   - Идентификатор преподавателя (ID)\n   - Имя преподавателя\n   - Фамилия преподавателя\n   - Должность преподавателя\n3. Таблица \"Студенты\" с полями:\n   - Идентификатор студента (ID)\n   - Имя студента\n   - Фамилия студента\n   - Группа студента\n4. Таблица \"Успеваемость\" с полями:\n   - Идентификатор студента (ID)\n   - Идентификатор учебного плана (ID)\n   - Оценка студента\n   - Дата оценки\n5. Таблица \"Комментарии\" с полями:\n   - Идентификатор комментария (ID)\n   - Идентификатор студента (ID)\n   - Автор комментария\n   - Текст комментария\n   - Дата создания комментария\nПри создании логической модели базы данных необходимо учесть следующие требования:\n1. Каждый учебный план должен иметь уникальное название и описание.\n2. Каждый учебный план должен быть связан с преподавателем.\n3. Каждый студент должен быть зарегистрирован в системе и иметь уникальные имя и фамилию.\n4. Каждый студент должен быть связан с учебным планом и иметь оценку по этому плану.\n5. Каждый студент может иметь несколько оценок по разным учебным планам.\n6. Каждый студент может иметь несколько комментариев от преподавателей.","label":[[463,491,"integer"],[502,525,"string"],[531,554,"string"],[560,588,"timestamp"],[594,624,"timestamp"],[667,694,"integer"],[705,722,"string"],[728,749,"string"],[755,778,"string"],[816,838,"integer"],[849,861,"string"],[867,883,"string"],[889,904,"string"],[946,968,"integer"],[979,1007,"integer"],[1018,1033,"integer"],[1039,1050,"timestamp"],[1091,1116,"integer"],[1127,1149,"integer"],[1160,1177,"string"],[1183,1200,"string"],[1206,1231,"timestamp"]],"Comments":[]}
{"id":1406,"text":"Задача: Создать базу данных для библиотеки, содержащую информацию о книгах, читателях и выдаче книг. База данных должна содержать следующие таблицы:\n1. Таблица \"Книги\" с полями: ID книги, Название книги, Автор книги, Год издания, Количество страниц.\n2. Таблица \"Читатели\" с полями: ID читателя, ФИО читателя, Адрес читателя, Телефон читателя.\n3. Таблица \"Выдача книг\" с полями: ID выдачи, ID книги, ID читателя, Дата выдачи, Дата возврата.","label":[[178,186,"integer"],[188,202,"string"],[204,215,"string"],[217,228,"integer"],[230,248,"integer"],[282,293,"integer"],[295,307,"string"],[309,323,"string"],[325,341,"integer"],[378,387,"integer"],[389,397,"integer"],[399,410,"integer"],[412,423,"timestamp"],[425,438,"timestamp"]],"Comments":[]}
{"id":1407,"text":"Задача: Создать базу данных для ресторана, содержащую информацию о блюдах, заказах и клиентах. База данных должна содержать следующие таблицы:\n1. Таблица \"Блюда\" с полями: ID блюда, Название блюда, Описание блюда, Цена блюда.\n2. Таблица \"Заказы\" с полями: ID заказа, Дата заказа, ID клиента, ID блюда, Количество блюд в заказе.\n3. Таблица \"Клиенты\" с полями: ID клиента, ФИО клиента, Адрес доставки, Телефон клиента.","label":[[172,180,"integer"],[182,196,"string"],[198,212,"string"],[214,224,"double"],[256,265,"integer"],[267,278,"timestamp"],[280,290,"integer"],[292,300,"integer"],[302,326,"integer"],[359,369,"integer"],[371,382,"string"],[384,398,"string"],[400,415,"integer"]],"Comments":[]}
{"id":1408,"text":"Задача: Создать базу данных для медицинского центра, содержащую информацию о пациентах, врачах и назначениях. База данных должна содержать следующие таблицы:\n1. Таблица \"Пациенты\" с полями: ID пациента, ФИО пациента, Дата рождения, Адрес проживания, Телефон пациента.\n2. Таблица \"Врачи\" с полями: ID врача, ФИО врача, Специальность врача, Опыт работы.\n3. Таблица \"Назначения\" с полями: ID назначения, ID пациента, ID врача, Дата назначения, Описание назначения.","label":[[190,201,"integer"],[203,215,"string"],[217,230,"timestamp"],[232,248,"string"],[250,266,"integer"],[296,305,"integer"],[307,316,"string"],[318,337,"string"],[339,350,"integer"],[386,399,"integer"],[401,412,"integer"],[414,422,"integer"],[424,439,"timestamp"],[441,460,"string"]],"Comments":[]}
{"id":1409,"text":"Задача: Создать базу данных для фитнес-клуба, содержащую информацию о клиентах, тренерах и занятиях. База данных должна содержать следующие таблицы:\n1. Таблица \"Клиенты\" с полями: ID клиента, ФИО клиента, Дата рождения, Адрес проживания, Телефон клиента.\n2. Таблица \"Тренеры\" с полями: ID тренера, ФИО тренера, Опыт работы, Специализация.\n3. Таблица \"Занятия\" с полями: ID занятия, Дата занятия, ID тренера, ID клиента, Описание занятия.","label":[[179,190,"integer"],[192,203,"string"],[205,218,"timestamp"],[220,236,"string"],[238,253,"integer"],[286,296,"integer"],[298,309,"string"],[311,322,"integer"],[324,337,"string"],[370,380,"integer"],[382,394,"timestamp"],[396,406,"integer"],[407,418,"integer"],[420,436,"string"]],"Comments":[]}
{"id":1410,"text":"Задача: Создать базу данных для туристического агентства, содержащую информацию о турах, клиентах и бронировании. База данных должна содержать следующие таблицы:\n1. Таблица \"Туры\" с полями: ID тура, Название тура, Описание тура, Дата начала, Продолжительность, Стоимость.\n2. Таблица \"Клиенты\" с полями: ID клиента, ФИО клиента, Адрес проживания, Телефон клиента.\n3. Таблица \"Бронирование\" с полями: ID бронирования, ID тура, ID клиента, Дата бронирования, Статус бронирования.","label":[[190,197,"integer"],[199,212,"string"],[214,227,"string"],[229,240,"timestamp"],[242,259,"integer"],[261,270,"double"],[303,313,"integer"],[315,326,"string"],[328,344,"string"],[346,361,"integer"],[399,414,"integer"],[416,423,"integer"],[425,435,"integer"],[437,454,"timestamp"],[456,475,"string"]],"Comments":[]}
{"id":1411,"text":"Задача: Создать базу данных для автосервиса, содержащую информацию о автомобилях, услугах и заказах. База данных должна содержать следующие таблицы:\n1. Таблица \"Автомобили\" с полями: ID автомобиля, Марка автомобиля, Модель автомобиля, Год выпуска, Пробег.\n2. Таблица \"Услуги\" с полями: ID услуги, Название услуги, Описание услуги, Стоимость услуги.\n3. Таблица \"Заказы\" с полями: ID заказа, Дата заказа, ID автомобиля, ID услуги, Описание заказа.","label":[[183,196,"integer"],[198,214,"string"],[216,233,"string"],[235,246,"integer"],[248,254,"integer"],[286,295,"integer"],[297,312,"string"],[314,329,"string"],[331,347,"double"],[379,388,"integer"],[390,401,"timestamp"],[403,416,"integer"],[418,427,"integer"],[429,444,"string"]],"Comments":[]}
{"id":1412,"text":"Задача: Создать базу данных для школы, содержащую информацию о учениках, учителях и оценках. База данных должна содержать следующие таблицы:\n1. Таблица \"Ученики\" с полями: ID ученика, ФИО ученика, Класс, Адрес проживания, Телефон ученика.\n2. Таблица \"Учителя\" с полями: ID учителя, ФИО учителя, Предмет, Опыт работы.\n3. Таблица \"Оценки\" с полями: ID оценки, ID ученика, ID учителя, Предмет, Оценка.","label":[[172,182,"integer"],[184,195,"string"],[197,202,"integer"],[204,220,"string"],[222,237,"integer"],[270,280,"integer"],[282,293,"string"],[295,302,"string"],[304,315,"integer"],[347,356,"integer"],[358,368,"integer"],[370,380,"integer"],[382,389,"string"],[391,397,"integer"]],"Comments":[]}
{"id":1413,"text":"Задача: Создать базу данных для курьерской службы, содержащую информацию о заказах, курьерах и доставке. База данных должна содержать следующие таблицы:\n1. Таблица \"Заказы\" с полями: ID заказа, Дата заказа, Адрес отправителя, Адрес получателя, Описание заказа.\n2. Таблица \"Курьеры\" с полями: ID курьера, ФИО курьера, Телефон курьера.\n3. Таблица \"Доставка\" с полями: ID доставки, ID заказа, ID курьера, Дата доставки, Статус доставки.","label":[[183,192,"integer"],[194,205,"timestamp"],[207,224,"string"],[226,242,"string"],[244,259,"string"],[292,302,"integer"],[304,315,"string"],[317,332,"integer"],[366,377,"integer"],[379,389,"integer"],[390,400,"integer"],[402,415,"timestamp"],[417,432,"string"]],"Comments":[]}
{"id":1414,"text":"Задача: Создать базу данных для спортивного клуба, содержащую информацию о тренерах, спортсменах и тренировках. База данных должна содержать следующие таблицы:\n1. Таблица \"Тренеры\" с полями: ID тренера, ФИО тренера, Опыт работы, Специализация.\n2. Таблица \"Спортсмены\" с полями: ID спортсмена, ФИО спортсмена, Дата рождения, Адрес проживания, Телефон спортсмена.\n3. Таблица \"Тренировки\" с полями: ID тренировки, Дата тренировки, ID тренера, ID спортсмена, Описание тренировки.","label":[[191,201,"integer"],[203,214,"string"],[216,227,"integer"],[229,242,"string"],[278,291,"integer"],[293,307,"string"],[309,322,"timestamp"],[324,340,"string"],[342,360,"integer"],[395,409,"integer"],[411,426,"timestamp"],[428,438,"integer"],[440,453,"integer"],[455,474,"string"]],"Comments":[]}
{"id":1415,"text":"Задача: Создать базу данных для гостиницы, содержащую информацию о номерах, гостях и бронировании. База данных должна содержать следующие таблицы:\n1. Таблица \"Номера\" с полями: ID номера, Название номера, Категория номера, Стоимость номера.\n2. Таблица \"Гости\" с полями: ID гостя, ФИО гостя, Дата рождения, Адрес проживания, Телефон гостя.\n3. Таблица \"Бронирование\" с полями: ID бронирования, Дата бронирования, ID номера, ID гостя, Статус бронирования.","label":[[177,186,"integer"],[188,203,"string"],[205,221,"string"],[223,239,"double"],[270,278,"integer"],[280,289,"string"],[291,304,"timestamp"],[306,322,"string"],[324,337,"integer"],[375,390,"integer"],[392,409,"timestamp"],[411,420,"integer"],[422,430,"integer"],[432,451,"string"]],"Comments":[]}
